# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)
  def excelslicer(exceldata)
    rows = exceldata.split("\n")
    datas = []
    rows.length.times do |y|
      cells = rows[y].split("\t")
      datas[y] = []
      cells.length.times do |x|
        datas[y][x] = cells[x]
      end
    end
    return datas
  end
#자산번호	취득일	자산명	규격	취득원가	구입처	내용연수
asset_seed = "10130490	2010-07-08	서버	블레이드 서버	 224,000,000 	 (주)네오인프라 	5
11130430	2011-09-06	저장장치(스토리지 480개)	허브센터용 저장장치	 345,765,000 	 (주)한경아이넷-대전 	5
11130431	2011-09-06	저장장치(스토리지 480개)	허브센터용 저장장치	 345,765,000 	 (주)한경아이넷-대전 	5
11130446	2011-09-09	서버 클러스터(서버 84대)	계산분석관리랙스위치kvm	 384,800,000 	 (주)아스카넷 	5
11130579	2011-10-06	서버	Dell(TM) PowerEdge(TM) R710 랙 마운트 서버	 6,526,667 	 (주)한경아이넷-대전 	5
11130580	2011-10-06	서버	Dell(TM) PowerEdge(TM) R710 랙 마운트 서버	 6,526,667 	 (주)한경아이넷-대전 	5
11130581	2011-10-06	서버	Dell(TM) PowerEdge(TM) R710 랙 마운트 서버	 6,526,667 	 (주)한경아이넷-대전 	5
11130601	2011-10-24	서버	Dell(TM) PowerEdge(TM) R710 Server	 6,563,334 	 (주)한경아이넷-대전 	5
11130602	2011-10-24	서버	Dell(TM) PowerEdge(TM) R710 Server	 6,563,334 	 (주)한경아이넷-대전 	5
11130603	2011-10-24	서버	Dell(TM) PowerEdge(TM) R710 Server	 6,563,334 	 (주)한경아이넷-대전 	5
12130001	2012-01-02	클러스터장비(서버 45대)	대용량데이터센터용	 256,500,000 	 (주)아스카넷 	5
12130141	2012-03-23	서버	Dell(TM) PowerEdge(TM) R710 랙 마운트 서버	 6,600,000 	 (주)한경아이넷-대전 	5
12130142	2012-03-23	서버	Dell(TM) PowerEdge(TM) R710 랙 마운트 서버	 6,600,000 	 (주)한경아이넷-대전 	5
12130143	2012-03-23	서버	Dell(TM) PowerEdge(TM) R710 랙 마운트 서버	 6,600,000 	 (주)한경아이넷-대전 	5
12130587	2012-07-02	스토리지	허브센터용	 604,200,000 	 (주)델타시스템 	5
12130588	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130589	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130590	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130591	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130592	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130593	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130594	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130595	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130596	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130597	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130598	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130599	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130600	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130601	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130602	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130603	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130604	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130605	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130606	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130607	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130608	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130609	2012-07-02	서버	서버	 8,181,820 	 (주)델타시스템 	5
12130618	2012-07-02	스위치	스위치	 50,000,000 	 (주)델타시스템 	5
12130619	2012-07-02	스위치	스위치	 50,000,000 	 (주)델타시스템 	5
12130623	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130624	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130625	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130626	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130627	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130628	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130629	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130630	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130631	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130632	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130633	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130634	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130635	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130636	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130637	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130638	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130639	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130640	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130641	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130642	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130643	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130644	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130645	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130646	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130647	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130648	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130649	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130650	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130651	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130652	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130653	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130654	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130655	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130656	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130657	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130658	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130659	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130660	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130661	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130662	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130663	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130664	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130665	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130666	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130667	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130668	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130669	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130670	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130671	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130672	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130673	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130674	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130675	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130676	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130677	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130678	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130679	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130680	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130681	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130682	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130683	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130684	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130685	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130686	2012-07-20	서버	서버	 5,000,000 	 (주)아스카넷 	5
12130687	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130688	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130689	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130690	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130691	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130692	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130693	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130694	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130695	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130696	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130697	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130698	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130699	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130700	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130701	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130702	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130703	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130704	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130705	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130706	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130707	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130708	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130709	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130710	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130711	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130712	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130713	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130714	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130715	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130716	2012-07-20	서버	서버	 5,910,000 	 (주)아스카넷 	5
12130717	2012-07-20	10G 네트워크 스위치	10G 네트워크 스위치	 48,000,000 	 (주)아스카넷 	5
12130718	2012-07-20	랙케비넷	랙케비넷	 2,800,000 	 (주)아스카넷 	5
12130719	2012-07-20	랙케비넷	랙케비넷	 2,800,000 	 (주)아스카넷 	5
12130720	2012-07-20	랙케비넷	랙케비넷	 2,800,000 	 (주)아스카넷 	5
12130721	2012-07-20	네트워크 스위치	네트워크 스위치	 4,700,000 	 (주)아스카넷 	5
12130722	2012-07-20	네트워크 스위치	네트워크 스위치	 4,700,000 	 (주)아스카넷 	5
12130723	2012-07-20	네트워크 스위치	네트워크 스위치	 4,700,000 	 (주)아스카넷 	5
12130724	2012-07-20	네트워크 스위치	네트워크 스위치	 4,700,000 	 (주)아스카넷 	5
12130725	2012-07-20	네트워크 스위치	네트워크 스위치	 4,700,000 	 (주)아스카넷 	5
12130726	2012-07-20	네트워크 스위치	네트워크 스위치	 4,700,000 	 (주)아스카넷 	5
12130742	2012-08-09	네트웍스위치	'WS-C3560X-48T-S	 9,950,000 	 (주)엔아이에스 - 한경 	5
12130743	2012-08-09	네트웍스위치	'WS-C3560X-48T-S	 9,950,000 	 (주)엔아이에스 - 한경 	5
12131207	2012-11-14	SECUI MF2 3000	SECUI MF2 3000	 128,700,000 	 코오롱글로벌 	5
12131052	2012-11-21	스위치	WS-C3560X-48T-S	 11,550,000 	 케이엘정보통신(주) 	5
12131053	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131054	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131055	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131056	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131057	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131058	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131059	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131060	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131061	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131062	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131063	2012-11-21	���버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131064	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131065	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131066	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131067	2012-11-21	서버	653200-B21 (HP DL380p Gen8)	 8,690,000 	 케이엘정보통신(주) 	5
12131217	2012-11-27	스위치 -SAN	SAN	 3,275,000 	 (주)네오인프라 	5
12131218	2012-11-27	스위치 -SAN	SAN	 3,275,000 	 (주)네오인프라 	5
12131221	2012-11-27	저장장치	저장장치	 175,380,000 	 (주)네오인프라 	5
13131001	2013-02-28	서버	Dell PowerEdge R720	 10,450,000 	 ㈜엠아이비 	3
13130730	2013-10-03	스토리지 Hitachi VSP  512GB/32Port 	Hitachi VSP Hardware - 512GB/32Port Usable 150/354TB	 628,000,000 	 (주)오파스넷 	5
13130731	2013-10-03	대용량 스위치 Dell Force10 Z9000	Dell Force10 Z9000 Switch	 63,334,000 	 (주)오파스넷 	5
13130732	2013-10-03	대용량 스위치 Dell Force10 Z9000	Dell Force10 Z9000 Switch	 63,333,000 	 (주)오파스넷 	5
13130733	2013-10-03	대용량 스위치 Dell Force10 Z9000	Dell Force10 Z9000 Switch	 63,333,000 	 (주)오파스넷 	5
13130734	2013-10-03	10G 스위치 Cisco Nexus 5548	Cisco Nexus 5548 Switch	 60,000,000 	 (주)오파스넷 	5
13130809	2013-11-22	스위치 SAN 2498-F48	2498-F48	 18,970,000 	 (주)네오인프라 	5
13130984	2013-12-12	서버 85개	DL360 G8	 542,985,500 	 (주)인디넷 	5
13130985	2013-12-12	스위치 대형 3개	Z9000	 156,750,000 	 (주)인디넷 	5
13130986	2013-12-12	스위치 소형 10개	6248	 40,865,000 	 (주)인디넷 	5
14130014	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130015	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130016	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130017	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130018	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130019	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130020	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130021	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130022	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130023	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130024	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130025	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130026	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130027	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130028	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130029	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130030	2014-02-14	서버 계산	R620	 8,200,000 	 (주)아스카넷 	5
14130050	2014-02-18	서버 Dell PowerEdge R620	Dell PowerEdge R620	 9,120,000 	 (주)아이와이시스템 	5
14130051	2014-02-18	서버 Dell PowerEdge R620	Dell PowerEdge R620	 9,120,000 	 (주)아이와이시스템 	5
14130077	2014-02-18	스위치 san 2498-F48	2498-F48	 18,400,000 	 (주)트루시스 	3
14130084	2014-02-21	스위치 네트웍 Cisco Nexus5548	Cisco Nexus5548	 18,865,000 	 (주)아이티케어 	3
14130187	2014-04-29	서버 Dell PowerEdge R620	Dell PowerEdge R620	 9,405,000 	 (주)아스카넷 	5
14130188	2014-04-29	서버 Dell PowerEdge R620	Dell PowerEdge R620	 9,405,000 	 (주)아스카넷 	5
14130674	2014-10-06	Rack	HP 42U Server Rack	 2,554,250 	 (주)인디넷 	5
14130675	2014-10-06	Rack	HP 42U Server Rack	 2,554,250 	 (주)인디넷 	5
14130676	2014-10-06	서버 55	DL360 G8	 380,000,500 	 (주)인디넷 	5
2015000036	2015-02-10	스토리지 증설	HNAS4080	 180,500,000 	 (주)씨디데이타 	5
2015000037	2015-02-10	저장장치 신규	HDS VSP	 359,000,000 	 (주)씨디데이타 	5
2015000038	2015-02-10	스위치 SAN	SAN BR6510	 17,500,000 	 (주)씨디데이타 	5
2015000039	2015-02-10	스위치 SAN	SAN BR6510	 17,500,000 	 (주)씨디데이타 	5
2015000040	2015-02-10	서버 관리용	DELL R6510	 8,200,000 	 (주)씨디데이타 	5
2015000041	2015-02-10	서버 관리용	DELL R6510	 8,200,000 	 (주)씨디데이타 	5
2015000042	2015-02-10	서버 관리용	DELL R6510	 8,200,000 	 (주)씨디데이타 	5
2015000043	2015-02-10	서버 관리용	DELL R6510	 8,200,000 	 (주)씨디데이타 	5
2015000044	2015-02-10	서버 관리용	DELL R6510	 8,200,000 	 (주)씨디데이타 	5
2015000045	2015-02-10	스위치  10G	CISCO NEXUS 5548	 45,000,000 	 (주)씨디데이타 	5
2015000927	2015-09-09	저장장치	EMC VNX8000	 410,856,900 	 ㈜비젼아이티 	5
2015000928	2015-09-09	10G 스위치	Dell Force10 S4810P	 21,450,000 	 ㈜비젼아이티 	5
2015000929	2015-09-09	10G 스위치	Dell Force10 S4810P	 21,450,000 	 ㈜비젼아이티 	5
2015000930	2015-09-09	10G 스위치	Dell Force10 S4810P	 21,450,000 	 ㈜비젼아이티 	5
2015000931	2015-09-09	10G 스위치	Dell Force10 S4810P	 21,450,000 	 ㈜비젼아이티 	5
2015000932	2015-09-09	10G 스위치	Dell Force10 S4810P	 21,450,000 	 ㈜비젼아이티 	5
2015000933	2015-09-09	10G 스위치	Dell Force10 S4810P	 21,450,000 	 ㈜비젼아이티 	5
2015000934	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000935	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000936	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000937	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000938	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000939	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000940	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000941	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000942	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000943	2015-09-09	관리서버	Dell PowerEdge R630	 12,210,000 	 ㈜비젼아이티 	5
2015000944	2015-09-09	SAN 스위치	EMC DS-6510B	 15,000,000 	 ㈜비젼아이티 	5
2015000945	2015-09-09	SAN 스위치	EMC DS-6510B	 15,000,000 	 ㈜비젼아이티 	5
2015001910	2015-12-04	스위치 10G Switch	S4810	 12,100,000 	 ㈜코어밸런스 	5
2015001911	2015-12-04	스위치 10G Switch	S4810	 12,100,000 	 ㈜코어밸런스 	5
2015001912	2015-12-04	스위치 10G Switch	S4810	 12,100,000 	 ㈜코어밸런스 	5
2015001913	2015-12-04	스위치 10G Switch	S4810	 12,100,000 	 ㈜코어밸런스 	5
2015001914	2015-12-04	서버 분석서버	R630	 285,000,000 	 ㈜코어밸런스 	5
2015001915	2015-12-04	랙 RACK	NETSHELTER SX 42U	 4,850,000 	 ㈜코어밸런스 	5
2016000560	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000561	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000562	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000563	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000564	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000565	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000566	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000567	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000568	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000569	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000570	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000571	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000572	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000573	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000574	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000575	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000576	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000577	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000578	2016-08-03	서버 (19개중 1개)	DL360Gen9	 12,889,000 	 (주)한경아이넷 	5
2016000579	2016-08-03	스위치	Dell S4048-ON	 20,004,500 	 (주)한경아이넷 	5
2016000580	2016-08-03	스위치	Dell S4048-ON	 20,004,500 	 (주)한경아이넷 	5
2016000742	2016-09-26	저장장치 16개	EMC NL410	 766,921,250 	 (주)시스컴 	5
2016000743	2016-09-28	서버	DELL R630	 16,500,000 	 (주)시스컴 	5
2016000744	2016-09-28	서버	DELL R630	 16,500,000 	 (주)시스컴 	5
2016000745	2016-09-28	서버	DELL R630	 16,500,000 	 (주)시스컴 	5
2016000746	2016-09-28	서버	DELL R630	 16,500,000 	 (주)시스컴 	5
2016000747	2016-09-28	서버	DELL R630	 16,500,000 	 (주)시스컴 	5
2016000839	2016-10-19	서버	DELL R630	 12,071,429 	 ㈜비즈넷21 	5
2016000840	2016-10-19	서버	DELL R630	 12,071,429 	 ㈜비즈넷21 	5
2016000841	2016-10-19	서버	DELL R630	 12,071,429 	 ㈜비즈넷21 	5
2016000842	2016-10-19	서버	DELL R630	 12,071,429 	 ㈜비즈넷21 	5
2016000843	2016-10-19	서버	DELL R630	 12,071,429 	 ㈜비즈넷21 	5
2016000844	2016-10-19	서버	DELL R630	 12,071,429 	 ㈜비즈넷21 	5
2016000845	2016-10-19	서버	DELL R630	 12,071,429 	 ㈜비즈넷21 	5
2016000846	2016-10-19	렉 A7550929	Dell Netshelter SX 42U	 2,960,000 	 ㈜코어밸런스 	5
2016000847	2016-10-19	렉 A7550929	Dell Netshelter SX 42U	 2,960,000 	 ㈜코어밸런스 	5
2016000848	2016-10-19	렉 A7550929	Dell Netshelter SX 42U	 2,960,000 	 ㈜코어밸런스 	5
2016000849	2016-10-19	렉 A7550929	Dell Netshelter SX 42U	 2,960,000 	 ㈜코어밸런스 	5
2016000850	2016-10-19	렉 A7550929	Dell Netshelter SX 42U	 2,960,000 	 ㈜코어밸런스 	5
2016000851	2016-10-19	렉 A7550929	Dell Netshelter SX 42U	 2,960,000 	 ㈜코어밸런스 	5"
asset_array = excelslicer(asset_seed)
asset_array.each do |unit|
   Asset.create(
      {
        :number => unit[0],
        :purchased_date => unit[1].to_date,
        :name => unit[2],
        :standard => unit[3],
        :price => unit[4],
        :seller => unit[5],
        :year => unit[6]
      }
  ) 
end

service_using_seed = "ALICE	 2,668 	 1,505 		 3,196 
KIAF	 100 		 300 	
CMS(HCP)	 276 		 160 	
BELLE	 212 	 107 	 - 	
LIGO	 636 		 478 	
RENO	 432 		 710 	
BIO	 420 		 600 	
EPIG	 - 		 100 	
TEM	 420 		 500 	
PubSer	 60 			
ADMIN	 640 			
VHM	 8 		 200 	
Gcloud	 300 			
Brain				
VISUAL		 150 		
Open Science				"

service_using_array = excelslicer(service_using_seed)
service_using_array.each_with_index do |unit, index|
   ServiceUsing.create(
       {
           :name => unit[0],
           :core => unit[1],
           :san => unit[2],
           :nas => unit[3],
           :tape => unit[4]
       }
   )
end

service_notusing_seed = "ALICE	 120 	 561 		
KIAF				
CMS(HCP)				
BELLE				
LIGO	 228 			
RENO				
BIO				
EPIG				
TEM				
PubSer				
ADMIN				
VHM				
Gcloud				
Brain	 684 		 400 	
VISUAL				
Open Science			 500 	
Open Science		 278 	 477 	 3,196 "

service_notusing_array = excelslicer(service_notusing_seed)
service_notusing_array.each_with_index do |unit, index|
   ServiceNotusing.create(
       {
           :name => unit[0],
           :core => unit[1],
           :san => unit[2],
           :nas => unit[3],
           :tape => unit[4]
       }
   )
end

#자산번호	관리번호	현재위치	관리스펙	Core	IP
server_seed = "10130490	S10006	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10007	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10008	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10009	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10010	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10011	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10012	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10013	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10014	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10015	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10016	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10017	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10018	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10019	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10020	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10021	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10022	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10023	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10024	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10025	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10026	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10027	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10028	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10029	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10030	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10031	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10032	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10033	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10034	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10035	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10036	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10037	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10038	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10039	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10040	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10041	본관 1층 공동서버실-C08	IBM BladeCenter HS22 Chassis3	12	
10130490	S10042	본관 1층 공동서버실-C08	IBM System x3550 M3	12	
11130446	S11002	본관 1층 제2전산실-R04	Dell PowerEdge R510	12	
11130446	S11003	본관 1층 제2전산실-R04	Dell PowerEdge R510	12	
11130446	S11004	본관 1층 제2전산실-R04	Dell PowerEdge R510	12	
11130446	S11005	본관 1층 제2전산실-R04	Dell PowerEdge R510	12	
11130446	S11006	본관 1층 제2전산실-R04	Dell PowerEdge R510	12	
11130446	S11007	본관 1층 제2전산실-R04	Dell PowerEdge R510	12	
11130446	S11008	본관 1층 제2전산실-R04	Dell PowerEdge R510	12	
11130446	S11009	본관 1층 제2전산실-R04	Dell PowerEdge R510	12	
11130446	S11010	본관 1층 제2전산실-R04	Dell PowerEdge R510	12	
11130446	S11011	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11012	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11013	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11014	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11015	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11016	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11017	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11018	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11019	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11020	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11021	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11022	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11023	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11024	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11025	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11026	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11027	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11028	본관 1층 공동서버실-C01	Dell PowerEdge R610	12	
11130446	S11029	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11030	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11031	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11032	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11033	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11034	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11035	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11036	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11037	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11038	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11039	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11040	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11041	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11042	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11043	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11044	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11045	본관 1층 공동서버실-C02	Dell PowerEdge R610	12	
11130446	S11046	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11047	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11048	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11049	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11050	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11051	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11052	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11053	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11054	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11055	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11056	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11057	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11058	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11059	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11060	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11061	본관 1층 공동서버실-C03	Dell PowerEdge R610	12	
11130446	S11062	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11063	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11064	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11065	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11066	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11067	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11068	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11069	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11070	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11071	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11072	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11073	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11074	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11075	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11076	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11077	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11078	본관 1층 공동서버실-C04	Dell PowerEdge R610	12	
11130446	S11079	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
11130446	S11080	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
11130446	S11081	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
11130446	S11082	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
11130446	S11083	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
11130446	S11084	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
11130446	S11085	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
11130579	S11086	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
11130580	S11087	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
11130581	S11088	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
11130601	S11089	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
11130602	S11090	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
11130603	S11091	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12001	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12002	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12003	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12004	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12005	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12006	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12007	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12008	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12009	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12010	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130001	S12011	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12012	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12013	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12014	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12015	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12016	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12017	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12018	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12019	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12020	본관 1층 공동서버실-C05	Dell PowerEdge R610	12	
12130001	S12021	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12022	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12023	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12024	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12025	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12026	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12027	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12028	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12029	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12030	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12031	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12032	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12033	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12034	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12035	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12036	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12037	본관 1층 공동서버실-C06	Dell PowerEdge R610	12	
12130001	S12038	본관 1층 공동서버실-C07	Dell PowerEdge R610	12	
12130001	S12039	본관 1층 공동서버실-C07	Dell PowerEdge R610	12	
12130001	S12040	본관 1층 공동서버실-C07	Dell PowerEdge R610	12	
12130001	S12041	본관 1층 공동서버실-C07	Dell PowerEdge R610	12	
12130001	S12042	본관 1층 공동서버실-C07	Dell PowerEdge R610	12	
12130001	S12043	본관 1층 공동서버실-C07	Dell PowerEdge R610	12	
12130001	S12044	본관 1층 공동서버실-C07	Dell PowerEdge R610	12	
12130001	S12045	본관 1층 공동서버실-C07	Dell PowerEdge R610	12	
12130141	S12046	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130142	S12047	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130143	S12048	본관 1층 제2전산실-R03	Dell PowerEdge R710	12	
12130588	S12049	본관 1층 제2전산실-R04	Dell PowerEdge R720	16	
12130589	S12050	본관 1층 제2전산실-R04	Dell PowerEdge R720	16	
12130590	S12051	본관 1층 제2전산실-R04	Dell PowerEdge R720	16	
12130591	S12052	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130592	S12053	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130593	S12054	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130594	S12055	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130595	S12056	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130596	S12057	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130597	S12058	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130598	S12059	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130599	S12060	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130600	S12061	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130601	S12062	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130602	S12063	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130603	S12064	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130604	S12065	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130605	S12066	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130606	S12067	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130607	S12068	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130608	S12069	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130609	S12070	본관 1층 제2전산실-R04	Dell PowerEdge R720	16	
12130623	S12071	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130624	S12072	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130625	S12073	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130626	S12074	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130627	S12075	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130628	S12076	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130629	S12077	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130630	S12078	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130631	S12079	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130632	S12080	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130633	S12081	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130634	S12082	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130635	S12083	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130636	S12084	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130637	S12085	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130638	S12086	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130639	S12087	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130640	S12088	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130641	S12089	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130642	S12090	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130643	S12091	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130644	S12092	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130645	S12093	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130646	S12094	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130647	S12095	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130648	S12096	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130649	S12097	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130650	S12098	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130651	S12099	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130652	S12100	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130653	S12101	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130654	S12102	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130655	S12103	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130656	S12104	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130657	S12105	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130658	S12106	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130659	S12107	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130660	S12108	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130661	S12109	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130662	S12110	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130663	S12111	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130664	S12112	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130665	S12113	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130666	S12114	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130667	S12115	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130668	S12116	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130669	S12117	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130670	S12118	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130671	S12119	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130672	S12120	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130673	S12121	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130674	S12122	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130675	S12123	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130676	S12124	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130677	S12125	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130678	S12126	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130679	S12127	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130680	S12128	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130681	S12129	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130682	S12130	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130683	S12131	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130684	S12132	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130685	S12133	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130686	S12134	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130687	S12135	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130688	S12136	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130689	S12137	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130690	S12138	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130691	S12139	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130692	S12140	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130693	S12141	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130694	S12142	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130695	S12143	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130696	S12144	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130697	S12145	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130698	S12146	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130699	S12147	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130700	S12148	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130701	S12149	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130702	S12150	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130703	S12151	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130704	S12152	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130705	S12153	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130706	S12154	본관 1층 제2전산실-R05	Dell PowerEdge R620	16	
12130707	S12155	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130708	S12156	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130709	S12157	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130710	S12158	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130711	S12159	본관 1층 제2전산실-R06	Dell PowerEdge R620	16	
12130712	S12160	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130713	S12161	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130714	S12162	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130715	S12163	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12130716	S12164	본관 1층 제2전산실-R07	Dell PowerEdge R620	16	
12131053	S12165	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131054	S12166	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131055	S12167	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131056	S12168	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131057	S12169	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131058	S12170	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131059	S12171	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131060	S12172	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131061	S12173	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131062	S12174	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131063	S12175	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131064	S12176	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131065	S12177	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131066	S12178	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
12131067	S12179	본관 1층 제2전산실-R12	HP DL380 Gen8	16	
13131001	S13001	본관 1층 제2전산실-R04	Dell Power Edge R720	16	
13130984	S13002	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13003	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13004	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13005	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13006	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13007	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13008	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13009	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13010	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13011	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13012	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13013	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13014	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13015	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13016	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13017	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13018	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13019	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13020	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13021	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13022	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13023	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13024	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13025	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13026	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13027	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13028	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13029	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13030	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13031	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13032	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13033	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13034	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13035	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13036	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13037	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13038	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13039	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13040	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13041	본관 1층 제2전산실-R08	HP DL360p Gen8	16	
13130984	S13042	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13043	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13044	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13045	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13046	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13047	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13048	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13049	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13050	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13051	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13052	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13053	본관 1층 제2전산실-R09	HP DL360p Gen8	16	
13130984	S13054	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13055	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13056	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13057	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13058	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13059	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13060	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13061	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13062	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13063	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13064	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13065	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13066	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13067	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13068	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13069	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13070	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13071	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13072	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13073	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13074	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13075	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13076	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13077	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13078	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13079	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13080	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13081	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13082	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13083	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13084	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13085	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
13130984	S13086	본관 1층 제2전산실-R10	HP DL360p Gen8	16	
14130014	S14001	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130015	S14002	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130016	S14003	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130017	S14004	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130018	S14005	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130019	S14006	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130020	S14007	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130021	S14008	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130022	S14009	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130023	S14010	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130024	S14011	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130025	S14012	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130026	S14013	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130027	S14014	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130028	S14015	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130029	S14016	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130030	S14017	본관 1층 제2전산실-R09	Dell PowerEdge R620	20	
14130050	S14018	본관 1층 제2전산실-R04	Dell PowerEdge R620	20	
14130051	S14019	본관 1층 제2전산실-R04	Dell PowerEdge R620	20	
14130187	S14020	본관 1층 제2전산실-R04	Dell PowerEdge R620	20	
14130188	S14021	본관 1층 제2전산실-R04	Dell PowerEdge R620	20	
14130676	S14022	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14023	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14024	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14025	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14026	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14027	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14028	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14029	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14030	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14031	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14032	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14033	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14034	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14035	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14036	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14037	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14038	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14039	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14040	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14041	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14042	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14043	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14044	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14045	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14046	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14047	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14048	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14049	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14050	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14051	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14052	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14053	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14054	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14055	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14056	본관 1층 제2전산실-R13	HP DL360p Gen8	20	
14130676	S14057	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14058	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14059	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14060	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14061	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14062	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14063	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14064	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14065	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14066	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14067	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14068	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14069	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14070	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14071	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14072	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14073	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14074	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14075	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
14130676	S14076	본관 1층 제2전산실-R14	HP DL360p Gen8	20	
2015000040	S15001	본관 1층 제2전산실-R14	Dell PowerEdge R620	20	
2015000041	S15002	본관 1층 제2전산실-R14	Dell PowerEdge R620	20	
2015000042	S15003	본관 1층 제2전산실-R14	Dell PowerEdge R620	20	
2015000043	S15004	본관 1층 제2전산실-R14	Dell PowerEdge R620	20	
2015000044	S15005	본관 1층 제2전산실-R14	Dell PowerEdge R620	20	
2015000934	S15006	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015000935	S15007	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015000936	S15008	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015000937	S15009	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015000938	S15010	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015000939	S15011	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015000940	S15012	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015000941	S15013	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015000942	S15014	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015000943	S15015	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15016	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15017	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15018	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15019	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15020	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15021	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15022	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15023	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15024	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15025	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15026	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15027	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15028	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15029	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15030	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15031	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15032	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15033	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15034	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2015001914	S15035	본관 1층 제2전산실-R11	Dell PowerEdge R630	28	
2016000560	S16001	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000561	S16002	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000562	S16003	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000563	S16004	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000564	S16005	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000565	S16006	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000566	S16007	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000567	S16008	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000568	S16009	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000569	S16010	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000570	S16011	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000571	S16012	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000572	S16013	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000573	S16014	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000574	S16015	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000575	S16016	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000576	S16017	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000577	S16018	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000578	S16019	본관 1층 공동서버실-C09	HP DL360p Gen9	36	
2016000743	S16020	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000744	S16021	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000745	S16022	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000746	S16023	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000747	S16024	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000839	S16025	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000840	S16026	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000841	S16027	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000842	S16028	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000843	S16029	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000844	S16030	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	
2016000845	S16031	본관 1층 제2전산실-C10	Dell PowerEdge R630	36	"
server_array = excelslicer(server_seed)
server_array.each_with_index do |unit, index|
    if Asset.where('number = ?', unit[0]).exists?
        parent_asset = Asset.where('number = ?', unit[0]).take

        server = parent_asset.servers
        server.create(
            {
                :number => unit[1],
                :location => unit[2],
                :spec => unit[3],
                :core => unit[4],
                :ip => unit[5]
            }
        )
    end
end

switch_seed = "11130430	N11010	본관 1층 제2전산실-R04	NEXUS 5548P 2011년	
11130431	N11011	본관 1층 제2전산실-R04	NEXUS 5548P 2011년	
11130446	N11012	본관 1층 공동서버실-C09	Dell 6248 2012년	
11130446	N11013	본관 1층 공동서버실-C09	Dell 6248 2012년	
12130001	N12001	본관 1층 제2전산실-R12	Dell  8024F 2011년	
12130001	N12002	본관 1층 제2전산실-R12	Dell  8024F 2011년	
12130001	N12003	본관 1층 제2전산실-R00	Brocade 300 2012년	
12130001	N12004	본관 1층 제2전산실-R00	Brocade 300 2012년	
12130618	N12005	본관 1층 제2전산실-R06	NEXUS 5548P 2012년	
12130619	N12006	본관 1층 제2전산실-R06	NEXUS 5548P 2012년	
12130717	N12007	본관 1층 제2전산실-R03	NEXUS 5548P 2012년	
12130721	N12008	본관 1층 공동서버실-C01	Dell 6248 2012년	
12130722	N12009	본관 1층 공동서버실-C01	Dell 6248 2012년	
12130723	N12010	본관 1층 공동서버실-C02	Dell 6248 2012년	
12130724	N12011	본관 1층 공동서버실-C02	Dell 6248 2012년	
12130725	N12012	본관 1층 공동서버실-C03	Dell 6248 2012년	
12130726	N12013	본관 1층 공동서버실-C03	Dell 6248 2012년	
12130742	N12014	본관 1층 제2전산실-R00	Cisco C3560-X 2012년	
12130743	N12015	본관 1층 제2전산실-R04	Cisco C3560-X 2012년	
12131207	N12018	본관 1층 제2전산실-R00	SECUI MF23000 방화벽	
12131052	N12016	본관 1층 제2전산실-R12	HP V1910	
12131052	N12019	본관 1층 공동서버실-C08	Cisco C3560-X 2012년	
12131217	N12020	본관 1층 제2전산실-R12	IBM 2498-B24 2012년	
12131218	N12021	본관 1층 제2전산실-R12	IBM 2498-B24 2012년	
13130730	N13003	본관 1층 제2전산실-R00	Brocade 6510	
13130730	N13004	본관 1층 제2전산실-R00	Brocade 6510	
13130731	N13008	본관 1층 제2전산실-R00	Z9000	
13130732	N13009	본관 1층 제2전산실-R00	Z9000	
13130733	N13010	본관 1층 제2전산실-R09	Z9000	
13130734	N13011	본관 1층 제2전산실-R03	NEXUS 5548P 2013년	
13130809	N13012	본관 1층 제2전산실-R10	IBM-2498-F48	
13130985	N13013	본관 1층 제2전산실-R00	Z9000	
13130985	N13014	본관 1층 제2전산실-R00	Z9000	
13130985	N13015	본관 1층 제2전산실-R09	Z9000	
13130986	N13016	본관 1층 공동서버실-C04	Dell 6248	
13130986	N13017	본관 1층 공동서버실-C04	Dell 6248	
13130986	N13018	본관 1층 공동서버실-C05	Dell 6248	
13130986	N13019	본관 1층 공동서버실-C05	Dell 6248	
13130986	N13020	본관 1층 공동서버실-C06	Dell 6248	
13130986	N13021	본관 1층 공동서버실-C06	Dell 6248	
13130986	N13022	본관 1층 공동서버실-C07	Dell 6248	
13130986	N13023	본관 1층 공동서버실-C07	Dell 6248	
14130077	N14001	본관 1층 제2전산실-R10	IBM-2498-F48	
14130084	N14002	본관 1층 제2전산실-R05	NEXUS 5548P 2014년	
2015000038	N15001	본관 1층 제2전산실-R03	Brocade 6510	
2015000039	N15002	본관 1층 제2전산실-R03	Brocade 6510	
2015000045	N15003	본관 1층 제2전산실-R05	NEXUS 5548P 2015년	
2015000928	N15008	본관 1층 제2전산실-R11	Dell Force10 S4810P 2015년	
2015000929	N15009	본관 1층 제2전산실-R11	Dell Force10 S4810P 2015년	
2015000930	N15010	본관 1층 제2전산실-R13	Dell Force10 S4810P 2015년	
2015000931	N15011	본관 1층 제2전산실-R13	Dell Force10 S4810P 2015년	
2015000932	N15012	본관 1층 제2전산실-R14	Dell Force10 S4810P 2015년	
2015000933	N15013	본관 1층 제2전산실-R14	Dell Force10 S4810P 2015년	
2015000944	N15014	본관 1층 제2전산실-R09	EMC DS-6510B	
2015000945	N15015	본관 1층 제2전산실-R09	EMC DS-6510B	
2015001910	N15016	본관 1층 제2전산실-R07	Dell Force10 S4810P 2015년	
2015001911	N15017	본관 1층 공동서버실-C10	Dell Force10 S4810P 2015년	
2015001912	N15018	본관 1층 공동서버실-C10	Dell Force10 S4810P 2015년	
2015001913	N15019	본관 1층 제2전산실-R07	Dell Force10 S4810P 2015년	
2016000579	N16001	본관 1층 공동서버실-C09	Dell Force10 S4048-ON 2016년	
2016000580	N16002	본관 1층 공동서버실-C09	Dell Force10 S4048-ON 2016년	"

switch_array = excelslicer(switch_seed)
switch_array.each_with_index do |unit, index|
    if Asset.where('number = ?', unit[0]).exists?
        parent_asset = Asset.where('number = ?', unit[0]).take

        switch = parent_asset.switches
        switch.create(
            {
                :number => unit[1],
                :location => unit[2],
                :spec => unit[3],
                :ip => unit[4]
            }
        )
    end
end



storage_seed = "11130430	D11001	본관 1층 제2전산실-EMC CX4-960-1	EMC CX4-960-1
11130431	D11002	본관 1층 제2전산실-EMC CX4-960-2	EMC CX4-960-2
12130587	D12002	본관 1층 제2전산실-EMC Isilon 2012	EMC Isilon 2012
12131221	D12011	본관 1층 제2전산실-IBM TAPE	IBM TS3500
13130730	D13002	본관 1층 제2전산실-Hitachi VSP-1	Hitachi VSP
2015000036	D15001	본관 1층 제2전산실-Hitachi VSP-1-D13002증설	Hitachi VSP
2015000037	D15002	본관 1층 제2전산실-Hitachi VSP-2	Hitachi VSP
2015000927	D15003	본관 1층 제2전산실-EMC VNX8000	EMC VNX8000
2016000742	D16001	본관 1층 제2전산실-EMC Isilon 2016	EMC Isilon 2016"
storage_array = excelslicer(storage_seed)
storage_array.each_with_index do |unit, index|
    if Asset.where('number = ?', unit[0]).exists?
        parent_asset = Asset.where('number = ?', unit[0]).take

        storage = parent_asset.storages
        storage.create(
            {
                :number => unit[1],
                :location => unit[2],
                :spec => unit[3]
            }
        )
    end
end

box_seed = "11130446	R11001	본관 1층 공동서버실-C03	DELL
11130446	R11002	본관 1층 공동서버실-C01	DELL
11130446	R11003	본관 1층 제2전산실-R00	DELL
12130001	R12001	본관 1층 제2전산실-R04	DELL
12130001	R12002	본관 1층 제2전산실-R03	DELL
12130588	R12005	본관 1층 제2전산실-R05	DELL
12130718	R12006	본관 1층 공동서버실-C02	DELL
12130719	R12007	본관 1층 제2전산실-R06	DELL
12130720	R12008	본관 1층 제2전산실-R07	DELL
13130984	R13007	본관 1층 제2전산실-R11	HP
13130984	R13008	본관 1층 제2전산실-R10	HP
13130984	R13009	본관 1층 제2전산실-R09	HP
13130984	R13010	본관 1층 제2전산실-R08	HP
14130674	R14001	본관 1층 제2전산실-R13	HP
14130675	R14002	본관 1층 제2전산실-R14	HP
2015001915	R15001	본관 1층 공동서버실-C10	DELL
2016000846	R16001	본관 1층 공동서버실-C04	DELL
2016000847	R16002	본관 1층 공동서버실-C05	DELL
2016000848	R16003	본관 1층 공동서버실-C06	DELL
2016000849	R16004	본관 1층 공동서버실-C07	DELL
2016000850	R16005	본관 1층 공동서버실-C08	DELL
2016000851	R16006	본관 1층 공동서버실-C09	DELL"
box_array = excelslicer(box_seed)
box_array.each_with_index do |unit, index|
    if Asset.where('number = ?', unit[0]).exists?
        parent_asset = Asset.where('number = ?', unit[0]).take

        box = parent_asset.boxes
        box.create(
            {
                :number => unit[1],
                :location => unit[2],
                :spec => unit[3]
            }
        )
    end
end

storage_info_seed = "11130430	EMC SAN-1	2011.9.6	 7.2K 2T 	 SAN 	 11,000.00 	 623.05 	
11130431	EMC SAN-2	2011.9.6	 7.2K 2T 	 SAN 	 11,000.00 	 623.05 	
12130587	EMC Isilon 2012	2012.7.2	 7.2K 2T 	 NAS 	 99,737.60 	 1,461.00 	
12131221	IBM TS3500	2012.11.27	 3592 4T 	 TAPE 		 3,196.00 	
13130730	Hitachi VSP-1	2013.10.3	 10K 900G 	 SAN 	 4,095.99 	 150.98 	
13130730	Hitachi VSP-1	2013.10.3	 7.2K 3T 	 SAN 	 4,095.99 	 352.60 	
2015000036	Hitachi VSP-1	2015.2.10	 7.2K 4T 	 SAN 	 4,095.99 	 256.43 	
2015000037	Hitachi VSP-2	2015.2.10	 SSD 	 SAN 	 2,453.47 	 9.58 	
2015000037	Hitachi VSP-2	2015.2.10	 10K 1.2T 	 SAN 	 6,440.96 	 176.12 	
2015000037	Hitachi VSP-2	2015.2.10	 7.2K 4T 	 SAN 	 21,882.88 	 384.66 	
2015000927	EMC VNX8000	2015.9.9	 7.2K 4T 	 SAN 	 22,011.58 	 1,504.70 	
2016000742	EMC Isilon 2016	2016.9.26	 7.2K 8T 	 NAS 	 193,536.00 	 3,024.00 	"

storage_info_array = excelslicer(storage_info_seed)
storage_info_array.each_with_index do |unit, index|
    if Storage.where('number = ?', unit[0]).exists?
        parent_storage = Storage.where('number = ?', unit[0]).take
        
        storage_info_unit = parent_storage.storage_infos.create(
            {
                :name => unit[1],
                :registration_date => unit[2],
                :disk_capacity => unit[3],
                :type => unit[4],
                :allocation_unit => unit[5],
                :allocation_volume => unit[6],
                :allocation_left => 0
            }
        )
    end
end

storage_allocation_seed = "11130431	EMC SAN-2	 7.2K 2T 	107.42	 BELLE 	 DATA 
11130431	EMC SAN-2	 7.2K 2T 	75.2	 VISUAL 	 DATA01 
11130431	EMC SAN-2	 7.2K 2T 	75.2	 VISUAL 	 DATA02 
12130587	EMC Isilon 2012	 7.2K 2T 	300	 BIO 	 SCRATCH 
12130587	EMC Isilon 2012	 7.2K 2T 	1	 ADMIN 	 ATLASSIAN 
12130587	EMC Isilon 2012	 7.2K 2T 	5	 ADMIN 	 BACKUP 
12130587	EMC Isilon 2012	 7.2K 2T 	10	 ADMIN 	 HOME 
12130587	EMC Isilon 2012	 7.2K 2T 	10	 ADMIN 	 LOG 
12130587	EMC Isilon 2012	 7.2K 2T 	2	 ADMIN 	 REPOS 
12130587	EMC Isilon 2012	 7.2K 2T 	10	 ADMIN 	 RH_EXPORT 
12130587	EMC Isilon 2012	 7.2K 2T 	1	 ADMIN 	 RH_ISO 
12130587	EMC Isilon 2012	 7.2K 2T 	50	 CMS(HCP) 	 DATA01 
12130587	EMC Isilon 2012	 7.2K 2T 	100	 CMS(HCP) 	 DATA02 
12130587	EMC Isilon 2012	 7.2K 2T 	1	 CMS(HCP) 	 HOME 
12130587	EMC Isilon 2012	 7.2K 2T 	1	 CMS(HCP) 	 LIB 
12130587	EMC Isilon 2012	 7.2K 2T 	1	 LIGO 	 KAGRA_SCRATCH 
12130587	EMC Isilon 2012	 7.2K 2T 	300	 LIGO 	 DATA01 
12130587	EMC Isilon 2012	 7.2K 2T 	1	 LIGO 	 LDRDB 
12130587	EMC Isilon 2012	 7.2K 2T 	320	 RENO 	 DATA01 
12130587	EMC Isilon 2012	 7.2K 2T 	200	 RENO 	 DATA02 
12130587	EMC Isilon 2012	 7.2K 2T 	130	 RENO 	 DATA03 
12131221	IBM TS3500	 3592 4T 	3,196.00	 ALICE 	 TAPE 
13130730	Hitachi VSP-1	 10K 900G 	20	 ALICE 	 XPT1219 
13130730	Hitachi VSP-1	 10K 900G 	20	 ALICE 	 XPT1220 
13130730	Hitachi VSP-1	 10K 900G 	4	 ALICE 	 TH01 
13130730	Hitachi VSP-1	 10K 900G 	4	 ALICE 	 TH02 
2015000037	Hitachi VSP-2	 SSD 	4.79	 ADMIN 	 LOG_01 
2015000037	Hitachi VSP-2	 SSD 	4.79	 ADMIN 	 LOG_02 
2015000037	Hitachi VSP-2	 10K 1.2T 	25.16	 ALICE 	 TP01 
2015000037	Hitachi VSP-2	 10K 1.2T 	25.16	 ALICE 	 TP02 
2015000037	Hitachi VSP-2	 10K 1.2T 	25.16	 ALICE 	 TP03 
2015000037	Hitachi VSP-2	 10K 1.2T 	25.16	 ALICE 	 TP04 
2015000037	Hitachi VSP-2	 10K 1.2T 	25.16	 ALICE 	 TP05 
2015000037	Hitachi VSP-2	 10K 1.2T 	25.16	 ALICE 	 TP06 
2015000037	Hitachi VSP-2	 10K 1.2T 	25.16	 ALICE 	 TP07 
2015000037	Hitachi VSP-2	 10K 1.2T 	25.16	 ALICE 	 TP08 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1201 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1202 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1203 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1204 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1205 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1206 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1207 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1208 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1209 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1210 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1211 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1212 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1213 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1214 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1215 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1216 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1217 
2015000037	Hitachi VSP-2	 7.2K 4T 	21.37	 ALICE 	 XPT1218 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1001 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1002 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1003 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1004 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1005 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1006 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1007 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1008 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1009 
2015000927	EMC VNX8000	 7.2K 4T 	150.47	 ALICE 	 XP1010 
2016000742	EMC Isilon 2016	 7.2K 8T 	10	 TEM 	 TEM 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.15	 ADMIN 	 SEVER 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.06	 ADMIN 	 Daniel 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.1	 LIGO 	 KAGRA_HOME 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.5	 RENO 	 HOME 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.03	 BELLE 	 LIB01 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.05	 BELLE 	 LIB02 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.01	 RENO 	 LIB 
2016000742	EMC Isilon 2016	 7.2K 8T 	5	 LIGO 	 HOME 
2016000742	EMC Isilon 2016	 7.2K 8T 	20	 RENO 	 REFORM01 
2016000742	EMC Isilon 2016	 7.2K 8T 	29.98	 LIGO 	 KAGRA_ARCHIVE 
2016000742	EMC Isilon 2016	 7.2K 8T 	4.5	 BELLE 	 HOME 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.2	 BIO 	 HOME 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.1	 BIO 	 LIB 
2016000742	EMC Isilon 2016	 7.2K 8T 	0.1	 LIGO 	 LIB 
2016000742	EMC Isilon 2016	 7.2K 8T 	10	 LIGO 	 SCRATCH 
2016000742	EMC Isilon 2016	 7.2K 8T 	32	 RENO 	 RAW01 
2016000742	EMC Isilon 2016	 7.2K 8T 	50	 KIAF 	 DATA01 
2016000742	EMC Isilon 2016	 7.2K 8T 	50	 KIAF 	 DATA02 
2016000742	EMC Isilon 2016	 7.2K 8T 	50	 KIAF 	 DATA03 
2016000742	EMC Isilon 2016	 7.2K 8T 	50	 KIAF 	 DATA04 
2016000742	EMC Isilon 2016	 7.2K 8T 	50	 VHM 	 DATA01 
2016000742	EMC Isilon 2016	 7.2K 8T 	50	 VHM 	 DATA02 
2016000742	EMC Isilon 2016	 7.2K 8T 	50	 VHM 	 DATA03 
2016000742	EMC Isilon 2016	 7.2K 8T 	50	 VHM 	 DATA04 "

storage_allocation_array = excelslicer(storage_allocation_seed)
storage_allocation_array.each_with_index do |unit, index|
    storage_allocation_unit = StorageAllocation.create(
        {
            :allocation => unit[3],
            :purpose => unit[5]
        }
    )
    if StorageInfo.where('number = ?', unit[0]).exists?
        parent_storage_info = StorageInfo.where('number = ?', unit[0]).take
        parent_storage_info.storage_allocations << storage_allocation_unit
    end
    
    if ServiceUsing.where('name = ?', unit[4]).exists?
        storage_allocation_unit.service = ServiceUsing.where('name = ?', unit[4]).take
    end
end

box_info_array.each_with_index do |unit, index|
    if Box.where('number = ?', unit[0].split(' - ')[1]).exists?
        parent_box = Box.where('number = ?', unit[0].split(' - ')[1]).take

        box_info_unit = parent_box.box_infos.create (
            {
                :location => unit[0].split(' - ')[0],
                :index_start => unit[1],
                :index_length => '',
                :ip => unit[2],
                :name => unit[4],
                :color => unit[5]
            }
        )
        
        if box_info_unit.box.nil?
            byebug
        end
        if unit[3].present?
            if unit[3].split('')[0] == 'N'
                if Switch.where('number = ?', unit[3]).exists?
                    box_info_unit.switch = Switch.where('number = ?', unit[3]).take
                end
            elsif unit[3].split('')[0] == 'S'
                if Server.where('number = ?', unit[3]).exists?
                    box_info_unit.server = Server.where('number = ?', unit[3]).take
                end
            end
            box_info_unit.save
        end
    end
end

box_info_seed = "R00 - R11003	42					
R00 - R11003	41					
R00 - R11003	40					
R00 - R11003	39					
R00 - R11003	38					
R00 - R11003	37					
R00 - R11003	36	192.168.2.4	N12014	Cisco C3560	#FFCCFF	
R00 - R11003	35	192.168.2.19	N12018	SECUI MF23000 2012년	#7030A0	CMS(HCP)
R00 - R11003	34	192.168.2.19	N12018	SECUI MF23000 2012년		CMS(HCP)
R00 - R11003	33	192.168.123.2	N13008	Force10 Z9000	#FFCCFF	
R00 - R11003	32	192.168.123.2	N13008	Force10 Z9000	#FFCCFF	
R00 - R11003	31	192.168.123.2	N13008	Force10 Z9000	#FFCCFF	
R00 - R11003	30	192.168.123.2	N13008	Force10 Z9000	#FFCCFF	
R00 - R11003	29	192.168.123.2	N13008	Force10 Z9000	#FFCCFF	
R00 - R11003	28	192.168.123.2	N13008	Force10 Z9000	#FFCCFF	
R00 - R11003	27	192.168.123.3	N13009	Force10 Z9000	#FFCCFF	
R00 - R11003	26	192.168.123.3	N13009	Force10 Z9000	#FFCCFF	
R00 - R11003	25	192.168.123.3	N13009	Force10 Z9000	#FFCCFF	
R00 - R11003	24	192.168.123.3	N13009	Force10 Z9000	#FFCCFF	
R00 - R11003	23	192.168.123.3	N13009	Force10 Z9000	#FFCCFF	
R00 - R11003	22	192.168.123.3	N13009	Force10 Z9000	#FFCCFF	
R00 - R11003	21	192.168.123.2	N13013	Force10 Z9000	#FFCCFF	
R00 - R11003	20	192.168.123.2	N13013	Force10 Z9000	#FFCCFF	
R00 - R11003	19	192.168.123.2	N13013	Force10 Z9000	#FFCCFF	
R00 - R11003	18	192.168.123.2	N13013	Force10 Z9000	#FFCCFF	
R00 - R11003	17	192.168.123.2	N13013	Force10 Z9000	#FFCCFF	
R00 - R11003	16	192.168.123.2	N13013	Force10 Z9000	#FFCCFF	
R00 - R11003	15	192.168.123.3	N13014	Force10 Z9000	#FFCCFF	
R00 - R11003	14	192.168.123.3	N13014	Force10 Z9000	#FFCCFF	
R00 - R11003	13	192.168.123.3	N13014	Force10 Z9000	#FFCCFF	
R00 - R11003	12	192.168.123.3	N13014	Force10 Z9000	#FFCCFF	
R00 - R11003	11	192.168.123.3	N13014	Force10 Z9000	#FFCCFF	
R00 - R11003	10	192.168.123.3	N13014	Force10 Z9000	#FFCCFF	
R00 - R11003	9		N13003	Brocade 6510 2013년	#FFFFCC	
R00 - R11003	8		N13004	Brocade 6510 2013년	#FFFFCC	
R00 - R11003	7		N12003	Brocade 300 2012년	#FFFFCC	
R00 - R11003	6		N12004	Brocade 300 2012년	#FFFFCC	
R00 - R11003	5					
R00 - R11003	4		FDF (Fiber Distribution Frame)		#FFCCFF	
R00 - R11003	3		FDF (Fiber Distribution Frame)		#FFCCFF	
R00 - R11003	2		FDF (Fiber Distribution Frame)		#FFCCFF	
R00 - R11003	1		FDF (Fiber Distribution Frame)		#FFCCFF	
R03 - R12002	42	192.168.125.4	N10001	Juniper EX2500	#FFCCFF	
R03 - R12002	41	192.168.125.4	N10002	Juniper EX2500	#FFCCFF	
R03 - R12002	40					
R03 - R12002	39		N15001	Brocade 6510 2015년	#FFFFCC	
R03 - R12002	38		N15002	Brocade 6510 2015년	#FFFFCC	
R03 - R12002	37	192.168.125.39	S12010	Dell R710	#F79646	ALICE
R03 - R12002	36	192.168.125.39	S12010	Dell R710	#F79646	ALICE
R03 - R12002	35	192.168.125.38	S12009	Dell R710	#F79646	ALICE
R03 - R12002	34	192.168.125.38	S12009	Dell R710	#F79646	ALICE
R03 - R12002	33	192.168.125.37	S12008	Dell R710	#F79646	ALICE
R03 - R12002	32	192.168.125.37	S12008	Dell R710	#F79646	ALICE
R03 - R12002	31	192.168.125.36	S12007	Dell R710	#F79646	ALICE
R03 - R12002	30	192.168.125.36	S12007	Dell R710	#F79646	ALICE
R03 - R12002	29	192.168.125.35	S12006	Dell R710	#F79646	ALICE
R03 - R12002	28	192.168.125.35	S12006	Dell R710	#F79646	ALICE
R03 - R12002	27	192.168.125.34	S12005	Dell R710	#F79646	ALICE
R03 - R12002	26	192.168.125.34	S12005	Dell R710	#F79646	ALICE
R03 - R12002	25	192.168.125.33	S12004	Dell R710	#F79646	ALICE
R03 - R12002	24	192.168.125.33	S12004	Dell R710	#F79646	ALICE
R03 - R12002	23	192.168.125.32	S12003	Dell R710	#F79646	ALICE
R03 - R12002	22	192.168.125.32	S12003	Dell R710	#F79646	ALICE
R03 - R12002	21	192.168.125.31	S12002	Dell R710	#F79646	ALICE
R03 - R12002	20	192.168.125.31	S12002	Dell R710	#F79646	ALICE
R03 - R12002	19					
R03 - R12002	18	192.168.125.50	S11010	Dell R510	#99FF33	KIAF
R03 - R12002	17	192.168.125.50	S11010	Dell R510	#99FF33	KIAF
R03 - R12002	16	192.168.125.58	S11009	Dell R510	#99FF33	KIAF
R03 - R12002	15	192.168.125.58	S11009	Dell R510	#99FF33	KIAF
R03 - R12002	14	192.168.125.57	S11008	Dell R510	#99FF33	KIAF
R03 - R12002	13	192.168.125.57	S11008	Dell R510	#99FF33	KIAF
R03 - R12002	12	192.168.125.56	S11007	Dell R510	#99FF33	KIAF
R03 - R12002	11	192.168.125.56	S11007	Dell R510	#99FF33	KIAF
R03 - R12002	10	192.168.125.55	S11006	Dell R510	#99FF33	KIAF
R03 - R12002	9	192.168.125.55	S11006	Dell R510	#99FF33	KIAF
R03 - R12002	8	192.168.125.54	S11005	Dell R510	#99FF33	KIAF
R03 - R12002	7	192.168.125.54	S11005	Dell R510	#99FF33	KIAF
R03 - R12002	6	192.168.125.53	S11004	Dell R510	#99FF33	KIAF
R03 - R12002	5	192.168.125.53	S11004	Dell R510	#99FF33	KIAF
R03 - R12002	4	192.168.125.52	S11003	Dell R510	#99FF33	KIAF
R03 - R12002	3	192.168.125.52	S11003	Dell R510	#99FF33	KIAF
R03 - R12002	2	192.168.125.51	S11002	Dell R510	#99FF33	KIAF
R03 - R12002	1	192.168.125.51	S11002	Dell R510	#99FF33	KIAF
R04 - R12001	42					
R04 - R12001	41	192.168.123.4	N11010	NEXUS 5548P 2012년	#FFCCFF	
R04 - R12001	40					
R04 - R12001	39	192.168.123.4	N11011	NEXUS 5548P 2012년	#FFCCFF	
R04 - R12001	38					
R04 - R12001	37	192.168.123.5	N12015	Cisco 3560	#FFCCFF	
R04 - R12001	36	192.168.123.210	S10049	IBM M3	#C0504D	Administrator
R04 - R12001	35	192.168.123.241	S14018	Dell R620	#C0504D	Administrator
R04 - R12001	34	192.168.123.242	S14019	Dell R620	#C0504D	Administrator
R04 - R12001	33	192.168.123.238	S14020	Dell R620	#C0504D	Administrator
R04 - R12001	32	192.168.123.237	S14021	Dell R620	#C0504D	Administrator
R04 - R12001	31		S13001	Dell R720	#C0504D	Administrator
R04 - R12001	30		S13001	Dell R720	#C0504D	Administrator
R04 - R12001	29		S12049	Dell R720	#C0504D	Administrator
R04 - R12001	28		S12049	Dell R720	#C0504D	Administrator
R04 - R12001	27		S12050	Dell R720	#C0504D	Administrator
R04 - R12001	26		S12050	Dell R720	#C0504D	Administrator
R04 - R12001	25		S12051	Dell R720	#C0504D	Administrator
R04 - R12001	24		S12051	Dell R720	#C0504D	Administrator
R04 - R12001	23		S12070	Dell R720	#C0504D	Administrator
R04 - R12001	22		S12070	Dell R720	#C0504D	Administrator
R04 - R12001	21					
R04 - R12001	20	192.168.123.254	S12001	Dell R710	#C0504D	Administrator
R04 - R12001	19	192.168.123.254	S12001	Dell R710	#C0504D	Administrator
R04 - R12001	18	192.168.123.213	S12046	Dell R710	#C0504D	Administrator
R04 - R12001	17	192.168.123.213	S12046	Dell R710	#C0504D	Administrator
R04 - R12001	16	192.168.123.214	S12047	Dell R710	#C0504D	Administrator
R04 - R12001	15	192.168.123.214	S12047	Dell R710	#C0504D	Administrator
R04 - R12001	14	192.168.123.215	S12048	Dell R710	#C0504D	Administrator
R04 - R12001	13	192.168.123.215	S12048	Dell R710	#C0504D	Administrator
R04 - R12001	12	192.168.123.181	S11086	Dell R710	#C0504D	Administrator
R04 - R12001	11	192.168.123.181	S11086	Dell R710	#C0504D	Administrator
R04 - R12001	10	192.168.123.182	S11087	Dell R710	#C0504D	Administrator
R04 - R12001	9	192.168.123.182	S11087	Dell R710	#C0504D	Administrator
R04 - R12001	8	192.168.123.183	S11088	Dell R710	#C0504D	Administrator
R04 - R12001	7	192.168.123.183	S11088	Dell R710	#C0504D	Administrator
R04 - R12001	6	192.168.123.184	S11089	Dell R710	#C0504D	Administrator
R04 - R12001	5	192.168.123.184	S11089	Dell R710	#C0504D	Administrator
R04 - R12001	4	192.168.123.211	S11090	Dell R710	#C0504D	Administrator
R04 - R12001	3	192.168.123.211	S11090	Dell R710	#C0504D	Administrator
R04 - R12001	2	192.168.123.212	S11091	Dell R710	#C0504D	Administrator
R04 - R12001	1	192.168.123.212	S11091	Dell R710	#C0504D	Administrator
R05 - R12005	42					
R05 - R12005	41	192.168.124.9	N14002	NEXUS 5548P 2014년	#FFCCFF	
R05 - R12005	40					
R05 - R12005	39	192.168.124.9	N15003	NEXUS 5548P 2014년	#FFCCFF	
R05 - R12005	38	192.168.124.51	S12071	Dell R620		
R05 - R12005	37	192.168.124.52	S12072	Dell R620		
R05 - R12005	36	192.168.124.53	S12073	Dell R620		
R05 - R12005	35	192.168.124.54	S12074	Dell R620		
R05 - R12005	34	192.168.124.55	S12075	Dell R620		
R05 - R12005	33	192.168.124.56	S12076	Dell R620		
R05 - R12005	32	192.168.124.57	S12077	Dell R620		
R05 - R12005	31	192.168.124.58	S12078	Dell R620		
R05 - R12005	30	192.168.124.59	S12079	Dell R620		
R05 - R12005	29	192.168.124.60	S12080	Dell R620		
R05 - R12005	28	192.168.124.61	S12081	Dell R620		
R05 - R12005	27	192.168.124.62	S12082	Dell R620		
R05 - R12005	26	192.168.124.63	S12083	Dell R620		
R05 - R12005	25	192.168.124.64	S12084	Dell R620		
R05 - R12005	24	192.168.124.65	S12085	Dell R620		
R05 - R12005	23	192.168.124.66	S12086	Dell R620		
R05 - R12005	22	192.168.124.67	S12087	Dell R620		
R05 - R12005	21					
R05 - R12005	20	192.168.124.68	S12088	Dell R620		
R05 - R12005	19	192.168.124.69	S12089	Dell R620		
R05 - R12005	18	192.168.124.70	S12090	Dell R620		
R05 - R12005	17	192.168.124.71	S12091	Dell R620		
R05 - R12005	16	192.168.124.72	S12092	Dell R620		
R05 - R12005	15	192.168.124.73	S12093	Dell R620		
R05 - R12005	14	192.168.124.74	S12094	Dell R620		
R05 - R12005	13	192.168.124.75	S12095	Dell R620		
R05 - R12005	12	192.168.124.76	S12096	Dell R620		
R05 - R12005	11	192.168.124.77	S12097	Dell R620		
R05 - R12005	10	192.168.124.78	S12098	Dell R620		
R05 - R12005	9	192.168.124.79	S12099	Dell R620		
R05 - R12005	8	192.168.124.80	S12100	Dell R620		
R05 - R12005	7	192.168.124.81	S12148	Dell R620		
R05 - R12005	6	192.168.124.82	S12149	Dell R620		
R05 - R12005	5	192.168.124.83	S12150	Dell R620		
R05 - R12005	4	192.168.224.250	S12151	Dell R620		
R05 - R12005	3	192.168.224.251	S12152	Dell R620		
R05 - R12005	2	192.168.224.252	S12153	Dell R620		
R05 - R12005	1	192.168.224.253	S12154	Dell R620		
R06 - R12007	42					
R06 - R12007	41	192.168.124.10	N12006	NEXUS 5548P 2012년	#FFCCFF	
R06 - R12007	40					
R06 - R12007	39	192.168.124.10	N12005	NEXUS 5548P Catalyst 3560-X  2012년	#FFCCFF	
R06 - R12007	38	192.168.124.165	S12155	Dell R620	#808080	BIO
R06 - R12007	37	192.168.124.164	S12156	Dell R620	#808080	BIO
R06 - R12007	36	192.168.124.163	S12157	Dell R620	#808080	BIO
R06 - R12007	35	192.168.124.162	S12158	Dell R620	#808080	BIO
R06 - R12007	34	192.168.124.161	S12159	Dell R620	#808080	BIO
R06 - R12007	33	192.168.124.160	S12131	Dell R620	#808080	BIO
R06 - R12007	32	192.168.124.159	S12130	Dell R620	#808080	BIO
R06 - R12007	31	192.168.124.158	S12129	Dell R620	#808080	BIO
R06 - R12007	30	192.168.124.157	S12128	Dell R620	#808080	BIO
R06 - R12007	29	192.168.124.156	S12127	Dell R620	#808080	BIO
R06 - R12007	28	192.168.124.155	S12126	Dell R620	#808080	BIO
R06 - R12007	27	192.168.124.154	S12125	Dell R620	#808080	BIO
R06 - R12007	26	192.168.124.153	S12124	Dell R620	#808080	BIO
R06 - R12007	25	192.168.124.152	S12123	Dell R620	#808080	BIO
R06 - R12007	24	192.168.124.151	S12122	Dell R620	#663300	
R06 - R12007	23	192.168.124.150	S12121	Dell R620	#663300	
R06 - R12007	22	192.168.124.149	S12136	Dell R620		
R06 - R12007	21					
R06 - R12007	20	192.168.124.148	S12120	Dell R620		
R06 - R12007	19	192.168.124.147	S12119	Dell R620		
R06 - R12007	18	192.168.124.146	S12118	Dell R620		
R06 - R12007	17	192.168.124.145	S12117	Dell R620		
R06 - R12007	16	192.168.124.127	S12116	Dell R620		
R06 - R12007	15	192.168.124.126	S12115	Dell R620		
R06 - R12007	14	192.168.124.125	S12114	Dell R620		
R06 - R12007	13	192.168.124.124	S12113	Dell R620		
R06 - R12007	12	192.168.124.123	S12112	Dell R620		
R06 - R12007	11	192.168.124.122	S12111	Dell R620		
R06 - R12007	10	192.168.124.121	S12110	Dell R620		
R06 - R12007	9	192.168.124.120	S12109	Dell R620		
R06 - R12007	8	192.168.124.119	S12108	Dell R620		
R06 - R12007	7	192.168.124.118	S12107	Dell R620		
R06 - R12007	6	192.168.124.117	S12106	Dell R620		
R06 - R12007	5	192.168.124.116	S12105	Dell R620		
R06 - R12007	4	192.168.124.115	S12104	Dell R620		
R06 - R12007	3	192.168.124.114	S12103	Dell R620		
R06 - R12007	2	192.168.124.113	S12102	Dell R620		
R06 - R12007	1	192.168.124.112	S12101	Dell R620		
R07 - R12008	42					
R07 - R12008	41	192.168.125.5	N12007	NEXUS 5548P	#FFCCFF	
R07 - R12008	40					
R07 - R12008	39	192.168.125.5	N13011	NEXUS 5548P	#FFCCFF	
R07 - R12008	38	192.168.125.118	S12160	Dell R620	#F79646	ALICE
R07 - R12008	37	192.168.125.117	S12161	Dell R620	#F79646	ALICE
R07 - R12008	36	192.168.125.116	S12162	Dell R620	#F79646	ALICE
R07 - R12008	35	192.168.125.115	S12163	Dell R620	#F79646	ALICE
R07 - R12008	34	192.168.125.114	S12164	Dell R620	#F79646	ALICE
R07 - R12008	33	192.168.125.113	S12069	Dell R620	#F79646	ALICE
R07 - R12008	32	192.168.125.112	S12135	Dell R620	#F79646	ALICE
R07 - R12008	31	192.168.125.111	S12134	Dell R620	#F79646	ALICE
R07 - R12008	30	192.168.125.110	S12133	Dell R620	#F79646	ALICE
R07 - R12008	29	192.168.125.109	S12132	Dell R620	#F79646	ALICE
R07 - R12008	28	192.168.125.108	S12068	Dell R620	#F79646	ALICE
R07 - R12008	27	192.168.125.107	S12067	Dell R620	#F79646	ALICE
R07 - R12008	26	192.168.125.106	S12066	Dell R620	#F79646	ALICE
R07 - R12008	25	192.168.125.105	S12065	Dell R620	#F79646	ALICE
R07 - R12008	24	192.168.125.104	S12064	Dell R620	#F79646	ALICE
R07 - R12008	23	192.168.125.103	S12063	Dell R620	#F79646	ALICE
R07 - R12008	22	192.168.125.102	S12062	Dell R620	#F79646	ALICE
R07 - R12008	21	192.168.125.101	S12061	Dell R620	#F79646	ALICE
R07 - R12008	20	192.168.125.100	S12060	Dell R620	#F79646	ALICE
R07 - R12008	19	192.168.125.99	S12059	Dell R620	#F79646	ALICE
R07 - R12008	18	192.168.125.98	S12058	Dell R620	#F79646	ALICE
R07 - R12008	17	192.168.125.97	S12057	Dell R620	#F79646	ALICE
R07 - R12008	16	192.168.125.96	S12056	Dell R620	#F79646	ALICE
R07 - R12008	15	192.168.125.95	S12055	Dell R620	#F79646	ALICE
R07 - R12008	14	192.168.125.94	S12054	Dell R620	#F79646	ALICE
R07 - R12008	13	192.168.125.93	S12053	Dell R620	#F79646	ALICE
R07 - R12008	12	192.168.125.92	S12052	Dell R620	#F79646	ALICE
R07 - R12008	11	192.168.125.91	S12147	Dell R620	#F79646	ALICE
R07 - R12008	10	192.168.125.90	S12146	Dell R620	#F79646	ALICE
R07 - R12008	9	192.168.125.89	S12145	Dell R620	#F79646	ALICE
R07 - R12008	8	192.168.125.88	S12144	Dell R620	#F79646	ALICE
R07 - R12008	7	192.168.125.87	S12143	Dell R620	#F79646	ALICE
R07 - R12008	6	192.168.125.86	S12142	Dell R620	#F79646	ALICE
R07 - R12008	5	192.168.125.85	S12141	Dell R620	#F79646	ALICE
R07 - R12008	4	192.168.125.84	S12140	Dell R620	#F79646	ALICE
R07 - R12008	3	192.168.125.83	S12139	Dell R620	#F79646	ALICE
R07 - R12008	2	192.168.125.82	S12138	Dell R620	#F79646	ALICE
R07 - R12008	1	192.168.125.81	S12137	Dell R620	#F79646	ALICE
R08 - R13010	42		N13010-Panel	Force10 Z9000	#FFCCFF	
R08 - R13010	41		N13015-Panel	Force10 Z9000	#FFCCFF	
R08 - R13010	40	192.168.125.195	S13041	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	39	192.168.125.194	S13040	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	38	192.168.125.193	S13039	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	37	192.168.125.192	S13038	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	36	192.168.125.191	S13037	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	35	192.168.125.190	S13036	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	34	192.168.125.189	S13035	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	33	192.168.125.188	S13034	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	32	192.168.125.187	S13033	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	31	192.168.125.186	S13032	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	30	192.168.125.185	S13031	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	29	192.168.125.184	S13030	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	28	192.168.125.183	S13029	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	27	192.168.125.182	S13028	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	26	192.168.125.181	S13027	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	25	192.168.125.180	S13026	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	24	192.168.125.179	S13025	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	23	192.168.125.178	S13024	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	22	192.168.125.177	S13023	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	21	192.168.125.176	S13022	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	20	192.168.125.175	S13021	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	19	192.168.125.174	S13020	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	18	192.168.125.173	S13019	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	17	192.168.125.172	S13018	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	16	192.168.125.171	S13017	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	15	192.168.125.170	S13016	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	14	192.168.125.169	S13015	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	13	192.168.125.168	S13014	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	12	192.168.125.167	S13013	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	11	192.168.125.166	S13012	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	10	192.168.125.165	S13011	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	9	192.168.125.164	S13010	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	8	192.168.125.163	S13009	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	7	192.168.125.162	S13008	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	6	192.168.125.161	S13007	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	5	192.168.125.160	S13006	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	4	192.168.125.159	S13005	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	3	192.168.125.158	S13004	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	2	192.168.125.157	S13003	HP DL360p Gen8	#F79646	ALICE
R08 - R13010	1	192.168.125.156	S13002	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	42					
R09 - R13009	41	192.168.125.7	N13010	Force10 Z9000	#FFCCFF	
R09 - R13009	40	192.168.125.7	N13010	Force10 Z9000	#FFCCFF	
R09 - R13009	39	192.168.125.7	N13010	Force10 Z9000	#FFCCFF	
R09 - R13009	38	192.168.125.7	N13015	Force10 Z9000	#FFCCFF	
R09 - R13009	37	192.168.125.7	N13015	Force10 Z9000	#FFCCFF	
R09 - R13009	36	192.168.125.7	N13015	Force10 Z9000	#FFCCFF	
R09 - R13009	35		N13010-Panel	Force10 Z9000	#FFCCFF	
R09 - R13009	34		N13015-Panel	Force10 Z9000	#FFCCFF	
R09 - R13009	33		N15014	EMC DS-6510B	#FFFFCC	
R09 - R13009	32		N15015	EMC DS-6510B	#FFFFCC	
R09 - R13009	31					
R09 - R13009	30	192.168.125.29	S14017	Dell R620	#F79646	ALICE
R09 - R13009	29	192.168.125.28	S14016	Dell R620	#F79646	ALICE
R09 - R13009	28	192.168.125.27	S14015	Dell R620	#F79646	ALICE
R09 - R13009	27	192.168.125.26	S14014	Dell R620	#F79646	ALICE
R09 - R13009	26	192.168.125.25	S14013	Dell R620	#F79646	ALICE
R09 - R13009	25	192.168.125.24	S14012	Dell R620	#F79646	ALICE
R09 - R13009	24	192.168.125.23	S14011	Dell R620	#F79646	ALICE
R09 - R13009	23	192.168.125.250	S14010	Dell R620	#F79646	ALICE
R09 - R13009	22					
R09 - R13009	21	192.168.125.249	S14009	Dell R620	#F79646	ALICE
R09 - R13009	20	192.168.125.248	S14008	Dell R620	#F79646	ALICE
R09 - R13009	19	192.168.125.247	S14007	Dell R620	#F79646	ALICE
R09 - R13009	18	192.168.125.246	S14006	Dell R620	#F79646	ALICE
R09 - R13009	17	192.168.125.245	S14005	Dell R620	#F79646	ALICE
R09 - R13009	16	192.168.125.244	S14004	Dell R620	#F79646	ALICE
R09 - R13009	15	192.168.125.243	S14003	Dell R620	#F79646	ALICE
R09 - R13009	14	192.168.125.242	S14002	Dell R620	#F79646	ALICE
R09 - R13009	13	192.168.125.241	S14001	Dell R620	#F79646	ALICE
R09 - R13009	12	192.168.125.207	S13053	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	11	192.168.125.206	S13052	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	10	192.168.125.205	S13051	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	9	192.168.125.204	S13050	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	8	192.168.125.203	S13049	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	7	192.168.125.202	S13048	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	6	192.168.125.201	S13047	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	5	192.168.125.200	S13046	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	4	192.168.125.199	S13045	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	3	192.168.125.198	S13044	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	2	192.168.125.197	S13043	HP DL360p Gen8	#F79646	ALICE
R09 - R13009	1	192.168.125.196	S13042	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	42		N13010-Panel	Force10 Z9000	#FFCCFF	
R10 - R13008	41		N13015-Panel	Force10 Z9000	#FFCCFF	
R10 - R13008	40		N13012	IBM 2498-F48	#FFFFCC	
R10 - R13008	39					
R10 - R13008	38		N14001	IBM 2498-F48	#FFFFCC	
R10 - R13008	37					
R10 - R13008	36					
R10 - R13008	35					
R10 - R13008	34					
R10 - R13008	33	192.168.125.240	S13086	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	32	192.168.125.239	S13085	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	31	192.168.125.238	S13084	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	30	192.168.125.237	S13083	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	29	192.168.125.236	S13082	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	28	192.168.125.235	S13081	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	27	192.168.125.234	S13080	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	26	192.168.125.233	S13079	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	25	192.168.125.232	S13078	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	24	192.168.125.231	S13077	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	23	192.168.125.230	S13076	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	22	192.168.125.229	S13075	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	21	192.168.125.228	S13074	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	20	192.168.125.227	S13073	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	19	192.168.125.226	S13072	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	18	192.168.125.225	S13071	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	17	192.168.125.224	S13070	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	16	192.168.125.223	S13069	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	15	192.168.125.222	S13068	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	14	192.168.125.221	S13067	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	13	192.168.125.220	S13066	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	12	192.168.125.219	S13065	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	11	192.168.125.218	S13064	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	10	192.168.125.217	S13063	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	9	192.168.125.216	S13062	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	8	192.168.125.215	S13061	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	7	192.168.125.214	S13060	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	6	192.168.125.213	S13059	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	5	192.168.125.212	S13058	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	4	192.168.125.211	S13057	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	3	192.168.125.210	S13056	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	2	192.168.125.209	S13055	HP DL360p Gen8	#F79646	ALICE
R10 - R13008	1	192.168.125.208	S13054	HP DL360p Gen8	#F79646	ALICE
R11 - R13007	42					
R11 - R13007	41	192.168.123.6	N15008	Force10 S4810P	#FFCCFF	
R11 - R13007	40					
R11 - R13007	39	192.168.123.6	N15009	Force10 S4810P	#FFCCFF	
R11 - R13007	38					
R11 - R13007	37					
R11 - R13007	36					
R11 - R13007	35					
R11 - R13007	34					
R11 - R13007	33					
R11 - R13007	32					
R11 - R13007	31		S15035	Dell R630	#FFFFFF	
R11 - R13007	30		S15034	Dell R630	#FFFFFF	
R11 - R13007	29		S15033	Dell R630	#FFFFFF	
R11 - R13007	28		S15032	Dell R630	#FFFFFF	
R11 - R13007	27		S15031	Dell R630	#FFFFFF	
R11 - R13007	26		S15030	Dell R630	#FFFFFF	
R11 - R13007	25		S15029	Dell R630	#FFFFFF	
R11 - R13007	24		S15028	Dell R630	#FFFFFF	
R11 - R13007	23		S15027	Dell R630	#FFFFFF	
R11 - R13007	22					
R11 - R13007	21		S15026	Dell R630	#FFFFFF	
R11 - R13007	20		S15025	Dell R630	#FFFFFF	
R11 - R13007	19		S15024	Dell R630	#FFFFFF	
R11 - R13007	18		S15023	Dell R630	#FFFFFF	
R11 - R13007	17		S15022	Dell R630	#FFFFFF	
R11 - R13007	16		S15021	Dell R630	#FFFFFF	
R11 - R13007	15		S15020	Dell R630	#FFFFFF	
R11 - R13007	14		S15019	Dell R630	#FFFFFF	
R11 - R13007	13		S15018	Dell R630	#FFFFFF	
R11 - R13007	12		S15017	Dell R630	#FFFFFF	
R11 - R13007	11		S15016	Dell R630	#FFFFFF	
R11 - R13007	10		S15015	Dell R630	#FFFFFF	
R11 - R13007	9		S15014	Dell R630	#FFFFFF	
R11 - R13007	8		S15013	Dell R630	#FFFFFF	
R11 - R13007	7		S15012	Dell R630	#FFFFFF	
R11 - R13007	6		S15011	Dell R630	#FFFFFF	
R11 - R13007	5		S15010	Dell R630	#FFFFFF	
R11 - R13007	4		S15009	Dell R630	#FFFFFF	
R11 - R13007	3		S15008	Dell R630	#FFFFFF	
R11 - R13007	2		S15007	Dell R630	#FFFFFF	
R11 - R13007	1		S15006	Dell R630	#FFFFFF	
R12 - R12009	42		N12001	Dell  8024F 2011년	#FFCCFF	
R12 - R12009	41					
R12 - R12009	40		N12002	Dell  8024F 2011년	#FFCCFF	
R12 - R12009	39					
R12 - R12009	38		N12016	HP V1910 V1910-48G 2012년	#FFCCFF	
R12 - R12009	37		N12020	IBM 2498-B24 2012년	#FFFFCC	
R12 - R12009	36		N12021	IBM 2498-B24 2012년	#FFFFCC	
R12 - R12009	35					
R12 - R12009	34					
R12 - R12009	33	192.168.125.61	S12180	IBM Consol	#F79646	ALICE
R12 - R12009	32	192.168.126.42	S12179	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	31	192.168.126.42	S12179	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	30	192.168.126.41	S12178	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	29	192.168.126.41	S12178	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	28	192.168.126.40	S12177	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	27	192.168.126.40	S12177	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	26	192.168.126.39	S12176	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	25	192.168.126.39	S12176	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	24	192.168.126.38	S12175	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	23	192.168.126.38	S12175	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	22					
R12 - R12009	21					
R12 - R12009	20	192.168.126.37	S12174	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	19	192.168.126.37	S12174	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	18	192.168.126.36	S12173	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	17	192.168.126.36	S12173	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	16	192.168.126.35	S12172	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	15	192.168.126.35	S12172	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	14	192.168.126.34	S12171	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	13	192.168.126.34	S12171	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	12	192.168.126.33	S12170	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	11	192.168.126.33	S12170	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	10	192.168.126.32	S12169	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	9	192.168.126.32	S12169	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	8	192.168.126.31	S12168	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	7	192.168.126.31	S12168	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	6	192.168.126.30	S12167	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	5	192.168.126.30	S12167	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	4	192.168.126.29	S12166	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	3	192.168.126.29	S12166	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	2	192.168.126.28	S12165	HP DL380p Gen8	#C5D9F1	Gcloud
R12 - R12009	1	192.168.126.28	S12165	HP DL380p Gen8	#C5D9F1	Gcloud
R13 - R14001	42					
R13 - R14001	41	192.168.123.10	N15010	Force10 S4810P	#FFCCFF	
R13 - R14001	40					
R13 - R14001	39	192.168.123.10	N15011	Force10 S4810P	#FFCCFF	
R13 - R14001	38					
R13 - R14001	37	203.250.113.0	Security Zone	Security Zone	#FFCCFF	
R13 - R14001	36					
R13 - R14001	35	192.168.123.155	S14056	HP DL360p Gen8	#FF00FF	Security Zone
R13 - R14001	34	192.168.123.154	S14055	HP DL360p Gen8	#FF00FF	Security Zone
R13 - R14001	33	192.168.123.153	S14054	HP DL360p Gen8	#FF00FF	Security Zone
R13 - R14001	32	192.168.123.152	S14053	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	31	192.168.123.151	S14052	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	30	192.168.123.150	S14051	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	29	192.168.123.149	S14050	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	28	192.168.123.148	S14049	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	27	192.168.123.147	S14048	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	26	192.168.123.146	S14047	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	25	192.168.123.145	S14046	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	24	192.168.123.144	S14045	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	23	192.168.123.143	S14044	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	22	192.168.123.142	S14043	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	21	192.168.123.141	S14042	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	20	192.168.123.140	S14041	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	19	192.168.123.139	S14040	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	18	192.168.123.138	S14039	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	17	192.168.123.137	S14038	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	16	192.168.123.136	S14037	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	15	192.168.123.135	S14036	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	14	192.168.123.134	S14035	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	13	192.168.123.133	S14034	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	12	192.168.123.132	S14033	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	11	192.168.123.131	S14032	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	10	192.168.123.130	S14031	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	9	192.168.123.129	S14030	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	8	192.168.123.128	S14029	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	7	192.168.123.127	S14028	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	6	192.168.123.126	S14027	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	5	192.168.123.125	S14026	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	4	192.168.123.124	S14025	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	3	192.168.123.123	S14024	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	2	192.168.123.122	S14023	HP DL360p Gen8	#C0534E	Administrator
R13 - R14001	1	192.168.123.121	S14022	HP DL360p Gen8	#C0534E	Administrator
R14 - R14002	42					
R14 - R14002	41		N15012	Force10 S4810P	#FFCCFF	
R14 - R14002	40					
R14 - R14002	39		N15013	Force10 S4810P	#FFCCFF	
R14 - R14002	38					
R14 - R14002	37					
R14 - R14002	36					
R14 - R14002	35					
R14 - R14002	34					
R14 - R14002	33					
R14 - R14002	32					
R14 - R14002	31					
R14 - R14002	30					
R14 - R14002	29					
R14 - R14002	28					
R14 - R14002	27					
R14 - R14002	26	192.168.125.143	S15005	Dell R620	#F79646	ALICE
R14 - R14002	25	192.168.125.142	S15004	Dell R620	#F79646	ALICE
R14 - R14002	24	192.168.125.141	S15003	Dell R620	#F79646	ALICE
R14 - R14002	23	192.168.125.140	S15002	Dell R620	#F79646	ALICE
R14 - R14002	22	192.168.125.139	S15001	Dell R620	#F79646	ALICE
R14 - R14002	21					
R14 - R14002	20	192.168.125.138	S14076	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	19	192.168.125.137	S14075	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	18	192.168.125.136	S14074	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	17	192.168.125.135	S14073	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	16	192.168.125.134	S14072	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	15	192.168.125.133	S14071	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	14	192.168.125.132	S14070	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	13	192.168.125.131	S14069	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	12	192.168.125.130	S14068	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	11	192.168.125.129	S14067	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	10	192.168.125.128	S14066	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	9	192.168.125.127	S14065	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	8	192.168.125.126	S14064	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	7	192.168.125.125	S14063	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	6	192.168.125.124	S14062	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	5	192.168.125.123	S14061	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	4	192.168.125.122	S14060	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	3	192.168.125.121	S14059	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	2	192.168.125.120	S14058	HP DL360p Gen8	#F79646	ALICE
R14 - R14002	1	192.168.125.119	S14057	HP DL360p Gen8	#F79646	ALICE
C01 - R11002	42					
C01 - R11002	41	192.168.124.5	N12008	Dell 6248	#FFCCFF	
C01 - R11002	40					
C01 - R11002	39	192.168.124.5	N12009	Dell 6248	#FFCCFF	
C01 - R11002	38					
C01 - R11002	37	192.168.124.216	S11011	Dell R610	#60497A	CMS(HCP)
C01 - R11002	36					
C01 - R11002	35	192.168.124.217	S11012	Dell R610	#60497A	CMS(HCP)
C01 - R11002	34					
C01 - R11002	33	192.168.124.218	S11013	Dell R610	#60497A	CMS(HCP)
C01 - R11002	32					
C01 - R11002	31	192.168.124.219	S11014	Dell R610	#60497A	CMS(HCP)
C01 - R11002	30					
C01 - R11002	29	192.168.124.220	S11015	Dell R610	#60497A	CMS(HCP)
C01 - R11002	28					
C01 - R11002	27	192.168.124.221	S11016	Dell R610	#60497A	CMS(HCP)
C01 - R11002	26					
C01 - R11002	25	192.168.124.222	S11017	Dell R610	#60497A	CMS(HCP)
C01 - R11002	24					
C01 - R11002	23	192.168.124.223	S11018	Dell R610	#60497A	CMS(HCP)
C01 - R11002	22					
C01 - R11002	21	192.168.124.224	S11019	Dell R610	#60497A	CMS(HCP)
C01 - R11002	20					
C01 - R11002	19	192.168.124.225	S11020	Dell R610	#60497A	CMS(HCP)
C01 - R11002	18					
C01 - R11002	17	192.168.124.226	S11021	Dell R610	#60497A	CMS(HCP)
C01 - R11002	16					
C01 - R11002	15	192.168.124.227	S11022	Dell R610	#60497A	CMS(HCP)
C01 - R11002	14					
C01 - R11002	13	192.168.124.228	S11023	Dell R610	#60497A	CMS(HCP)
C01 - R11002	12					
C01 - R11002	11	192.168.124.229	S11024	Dell R610	#60497A	CMS(HCP)
C01 - R11002	10					
C01 - R11002	9	192.168.124.230	S11025	Dell R610	#60497A	CMS(HCP)
C01 - R11002	8					
C01 - R11002	7	192.168.124.231	S11026	Dell R610	#60497A	CMS(HCP)
C01 - R11002	6					
C01 - R11002	5	192.168.124.232	S11027	Dell R610	#60497A	CMS(HCP)
C01 - R11002	4					
C01 - R11002	3	192.168.124.233	S11028	Dell R610	#60497A	CMS(HCP)
C01 - R11002	2					
C01 - R11002	1					
C02-R12006	42					
C02-R12006	41	192.168.124.6	N12010	Dell 6248	#FFCCFF	
C02-R12006	40					
C02-R12006	39	192.168.124.6	N12011	Dell 6248	#FFCCFF	
C02-R12006	38					
C02-R12006	37	192.168.124.234	S11029	Dell R610	#60497A	CMS(HCP)
C02-R12006	36					
C02-R12006	35	192.168.124.235	S11030	Dell R610	#60497A	CMS(HCP)
C02-R12006	34					
C02-R12006	33	192.168.124.236	S11031	Dell R610	#60497A	CMS(HCP)
C02-R12006	32					
C02-R12006	31	192.168.124.237	S11061	Dell R610	#60497A	CMS(HCP)
C02-R12006	30					
C02-R12006	29	192.168.124.238	S11062	Dell R610	#60497A	CMS(HCP)
C02-R12006	28					
C02-R12006	27	192.168.124.86	S11034	Dell R610	#FFFF00	RENO
C02-R12006	26					
C02-R12006	25	192.168.124.87	S11035	Dell R610	#FFFF00	RENO
C02-R12006	24					
C02-R12006	23	192.168.124.88	S11036	Dell R610	#FFFF00	RENO
C02-R12006	22					
C02-R12006	21					
C02-R12006	20					
C02-R12006	19	192.168.124.89	S11037	Dell R610	#FFFF00	RENO
C02-R12006	18					
C02-R12006	17	192.168.124.90	S11038	Dell R610	#FFFF00	RENO
C02-R12006	16					
C02-R12006	15	192.168.124.91	S11039	Dell R610	#FFFF00	RENO
C02-R12006	14					
C02-R12006	13	192.168.124.92	S11040	Dell R610	#FFFF00	RENO
C02-R12006	12					
C02-R12006	11	192.168.124.93	S11041	Dell R610	#FFFF00	RENO
C02-R12006	10					
C02-R12006	9	192.168.124.94	S11042	Dell R610	#FFFF00	RENO
C02-R12006	8					
C02-R12006	7	192.168.124.95	S11043	Dell R610	#FFFF00	RENO
C02-R12006	6					
C02-R12006	5	192.168.124.96	S11044	Dell R610	#FFFF00	RENO
C02-R12006	4					
C02-R12006	3	192.168.124.97	S11045	Dell R610	#FFFF00	RENO
C02-R12006	2					
C02-R12006	1					
C03-R11001	42		FDF (Fiber Distribution Frame)		#FFCCFF	
C03-R11001	41		FDF (Fiber Distribution Frame)		#FFCCFF	
C03-R11001	40		FDF (Fiber Distribution Frame)		#FFCCFF	
C03-R11001	39		FDF (Fiber Distribution Frame)		#FFCCFF	
C03-R11001	38					
C03-R11001	37	192.168.124.7	N12012	Dell 6248	#FFCCFF	
C03-R11001	36					
C03-R11001	35	192.168.124.7	N12013	Dell 6248	#FFCCFF	
C03-R11001	34					
C03-R11001	33	192.168.124.98	S11046	Dell R610	#FFFF00	RENO
C03-R11001	32					
C03-R11001	31	192.168.124.99	S11047	Dell R610	#FFFF00	RENO
C03-R11001	30					
C03-R11001	29	192.168.124.84	S11032	Dell R610	#FFFF00	RENO
C03-R11001	28					
C03-R11001	27	192.168.124.85	S11033	Dell R610	#FFFF00	RENO
C03-R11001	26					
C03-R11001	25	192.168.124.239	S11063	Dell R610	#FFFF00	RENO
C03-R11001	24					
C03-R11001	23	192.168.124.240	S11064	Dell R610	#FFFF00	RENO
C03-R11001	22					
C03-R11001	21	192.168.124.241	S11065	Dell R610	#FFFF00	reno
C03-R11001	20					
C03-R11001	19	192.168.124.208	S11053	Dell R610	#663300	BELLE
C03-R11001	18					
C03-R11001	17	192.168.124.209	S11054	Dell R610	#663300	BELLE
C03-R11001	16					
C03-R11001	15	192.168.124.210	S11055	Dell R610	#663300	BELLE
C03-R11001	14					
C03-R11001	13	192.168.124.211	S11056	Dell R610	#663300	BELLE
C03-R11001	12					
C03-R11001	11	192.168.124.212	S11057	Dell R610	#663300	BELLE
C03-R11001	10					
C03-R11001	9	192.168.124.213	S11058	Dell R610	#663300	BELLE
C03-R11001	8					
C03-R11001	7	192.168.124.214	S11059	Dell R610	#663300	BELLE
C03-R11001	6					
C03-R11001	5	192.168.124.215	S11060	Dell R610	#663300	BELLE
C03-R11001	4					
C03-R11001	3	192.168.124.203	S11048	Dell R610	#663300	BELLE
C03-R11001	2					
C03-R11001	1					
C04-R09001	42					
C04-R09001	41	192.168.124.11	N13016	Dell 6248	#FFCCFF	
C04-R09001	40					
C04-R09001	39	192.168.124.11	N13017	Dell 6248	#FFCCFF	
C04-R09001	38					
C04-R09001	37	192.168.124.204	S11049	Dell R610	#663300	BELLE
C04-R09001	36					
C04-R09001	35	192.168.124.205	S11050	Dell R610	#663300	BELLE
C04-R09001	34					
C04-R09001	33	192.168.124.206	S11051	Dell R610	#663300	BELLE
C04-R09001	32					
C04-R09001	31	192.168.124.207	S11052	Dell R610	#663300	BELLE
C04-R09001	30					
C04-R09001	29	192.168.124.242	S11066	Dell R610	#663300	BELLE
C04-R09001	28					
C04-R09001	27	192.168.124.243	S11067	Dell R610	#663300	BELLE
C04-R09001	26					
C04-R09001	25	192.168.124.244	S11068	Dell R610	#0000FF	LIGO
C04-R09001	24					
C04-R09001	23	192.168.124.245	S11069	Dell R610	#0000FF	LIGO
C04-R09001	22					
C04-R09001	21					
C04-R09001	20					
C04-R09001	19	192.168.124.246	S11070	Dell R610	#0000FF	LIGO
C04-R09001	18					
C04-R09001	17	192.168.124.247	S11071	Dell R610	#0000FF	LIGO
C04-R09001	16					
C04-R09001	15	192.168.124.248	S11072	Dell R610	#0000FF	LIGO
C04-R09001	14					
C04-R09001	13	192.168.124.249	S11073	Dell R610	#0000FF	LIGO
C04-R09001	12					
C04-R09001	11	192.168.124.100	S11074	Dell R610	#0000FF	LIGO
C04-R09001	10					
C04-R09001	9	192.168.124.101	S11075	Dell R610	#0000FF	LIGO
C04-R09001	8					
C04-R09001	7	192.168.124.102	S11076	Dell R610	#0000FF	LIGO
C04-R09001	6					
C04-R09001	5	192.168.124.103	S11077	Dell R610	#0000FF	LIGO
C04-R09001	4					
C04-R09001	3	192.168.124.104	S11078	Dell R610	#0000FF	LIGO
C04-R09001	2					
C04-R09001	1					
C05-R09002	42					
C05-R09002	41	192.168.124.12	N13018	Dell 6248	#FFCCFF	
C05-R09002	40					
C05-R09002	39	192.168.124.12	N13019	Dell 6248	#FFCCFF	
C05-R09002	38					
C05-R09002	37	192.168.124.105	S11079	Dell R610	#0000FF	LIGO
C05-R09002	36					
C05-R09002	35	192.168.124.106	S11080	Dell R610	#0000FF	LIGO
C05-R09002	34					
C05-R09002	33	192.168.124.107	S11081	Dell R610	#0000FF	LIGO
C05-R09002	32					
C05-R09002	31	192.168.124.108	S11082	Dell R610	#0000FF	LIGO
C05-R09002	30					
C05-R09002	29	192.168.124.109	S11083	Dell R610	#0000FF	LIGO
C05-R09002	28					
C05-R09002	27	192.168.124.110	S11084	Dell R610	#0000FF	LIGO
C05-R09002	26					
C05-R09002	25	192.168.124.111	S11085	Dell R610	#0000FF	LIGO
C05-R09002	24					
C05-R09002	23	192.168.124.16	S12011	Dell R610	#0000FF	LIGO
C05-R09002	22					
C05-R09002	21					
C05-R09002	20					
C05-R09002	19	192.168.124.17	S12012	Dell R610	#0000FF	LIGO
C05-R09002	18					
C05-R09002	17	192.168.124.18	S12013	Dell R610	#0000FF	LIGO
C05-R09002	16					
C05-R09002	15	192.168.124.19	S12014	Dell R610	#0000FF	LIGO
C05-R09002	14					
C05-R09002	13	192.168.124.20	S12015	Dell R610	#0000FF	LIGO
C05-R09002	12					
C05-R09002	11	192.168.124.21	S12016	Dell R610	#0000FF	LIGO
C05-R09002	10					
C05-R09002	9	192.168.124.22	S12017	Dell R610	#0000FF	LIGO
C05-R09002	8					
C05-R09002	7	192.168.124.23	S12018	Dell R610	#0000FF	LIGO
C05-R09002	6					
C05-R09002	5	192.168.124.24	S12019	Dell R610	#0000FF	LIGO
C05-R09002	4					
C05-R09002	3	192.168.124.25	S12020	Dell R610	#0000FF	LIGO
C05-R09002	2					
C05-R09002	1					
C06-R09003	42					
C06-R09003	41	192.168.124.13	N13020	Dell 6248	#FFCCFF	
C06-R09003	40					
C06-R09003	39	192.168.124.13	N13021	Dell 6248	#FFCCFF	
C06-R09003	38					
C06-R09003	37	192.168.124.26	S12021	Dell R610	#0000FF	LIGO
C06-R09003	36					
C06-R09003	35	192.168.124.27	S12022	Dell R610	#0000FF	LIGO
C06-R09003	34					
C06-R09003	33	192.168.124.28	S12023	Dell R610	#0000FF	LIGO
C06-R09003	32					
C06-R09003	31	192.168.124.29	S12024	Dell R610	#0000FF	LIGO
C06-R09003	30					
C06-R09003	29	192.168.124.30	S12025	Dell R610	#0000FF	LIGO
C06-R09003	28					
C06-R09003	27	192.168.124.31	S12026	Dell R610	#0000FF	LIGO
C06-R09003	26					
C06-R09003	25	192.168.124.32	S12027	Dell R610	#0000FF	LIGO
C06-R09003	24					
C06-R09003	23	192.168.124.33	S12028	Dell R610	#0000FF	LIGO
C06-R09003	22					
C06-R09003	21					
C06-R09003	20					
C06-R09003	19	192.168.124.34	S12029	Dell R610	#0000FF	LIGO
C06-R09003	18					
C06-R09003	17	192.168.124.35	S12030	Dell R610	#0000FF	LIGO
C06-R09003	16					
C06-R09003	15	192.168.124.36	S12031	Dell R610	#0000FF	LIGO
C06-R09003	14					
C06-R09003	13	192.168.124.37	S12032	Dell R610	#0000FF	LIGO
C06-R09003	12					
C06-R09003	11	192.168.124.38	S12033	Dell R610	#0000FF	LIGO
C06-R09003	10					
C06-R09003	9	192.168.124.39	S12034	Dell R610	#0000FF	LIGO
C06-R09003	8					
C06-R09003	7	192.168.124.40	S12035	Dell R610	#0000FF	LIGO
C06-R09003	6					
C06-R09003	5	192.168.124.41	S12036	Dell R610	#0000FF	LIGO
C06-R09003	4					
C06-R09003	3	192.168.124.42	S12037	Dell R610	#0000FF	LIGO
C06-R09003	2					
C06-R09003	1					
C07-R10002	42					
C07-R10002	41	192.168.124.14	N13022	Dell 6248	#FFCCFF	
C07-R10002	40					
C07-R10002	39	192.168.124.14	N13023	Dell 6248	#FFCCFF	
C07-R10002	38					
C07-R10002	37	192.168.124.43	S12038	Dell R610	#0000FF	LIGO
C07-R10002	36					
C07-R10002	35	192.168.124.44	S12039	Dell R610	#0000FF	LIGO
C07-R10002	34					
C07-R10002	33	192.168.124.45	S12040	Dell R610	#0000FF	LIGO
C07-R10002	32					
C07-R10002	31	192.168.124.46	S12041	Dell R610	#0000FF	LIGO
C07-R10002	30					
C07-R10002	29	192.168.124.47	S12042	Dell R610	#0000FF	LIGO
C07-R10002	28					
C07-R10002	27	192.168.124.48	S12043	Dell R610	#0000FF	LIGO
C07-R10002	26					
C07-R10002	25	192.168.124.49	S12044	Dell R610	#0000FF	LIGO
C07-R10002	24					
C07-R10002	23	192.168.124.50	S12045	Dell R610	#0000FF	LIGO
C07-R10002	22					
C07-R10002	21					
C07-R10002	20					
C07-R10002	19					
C07-R10002	18					
C07-R10002	17					
C07-R10002	16					
C07-R10002	15					
C07-R10002	14					
C07-R10002	13					
C07-R10002	12					
C07-R10002	11					
C07-R10002	10					
C07-R10002	9					
C07-R10002	8					
C07-R10002	7					
C07-R10002	6					
C07-R10002	5					
C07-R10002	4					
C07-R10002	3					
C07-R10002	2					
C07-R10002	1					
C08-R10001	42					
C08-R10001	41					
C08-R10001	40					
C08-R10001	39					
C08-R10001	38					
C08-R10001	37					
C08-R10001	36					
C08-R10001	35					
C08-R10001	34					
C08-R10001	33					
C08-R10001	32					
C08-R10001	31					
C08-R10001	30					
C08-R10001	29					
C08-R10001	28					
C08-R10001	27					
C08-R10001	26					
C08-R10001	25					
C08-R10001	24					
C08-R10001	23					
C08-R10001	22					
C08-R10001	21					
C08-R10001	20					
C08-R10001	19					
C08-R10001	18					
C08-R10001	17					
C08-R10001	16					
C08-R10001	15					
C08-R10001	14					
C08-R10001	13					
C08-R10001	12					
C08-R10001	11					
C08-R10001	10					
C08-R10001	9					
C08-R10001	8					
C08-R10001	7					
C08-R10001	6					
C08-R10001	5					
C08-R10001	4					
C08-R10001	3					
C08-R10001	2					
C08-R10001	1					
C09-R08001	42					
C09-R08001	41					
C09-R08001	40					
C09-R08001	39					
C09-R08001	38					
C09-R08001	37					
C09-R08001	36					
C09-R08001	35					
C09-R08001	34					
C09-R08001	33					
C09-R08001	32					
C09-R08001	31					
C09-R08001	30					
C09-R08001	29					
C09-R08001	28					
C09-R08001	27					
C09-R08001	26					
C09-R08001	25					
C09-R08001	24					
C09-R08001	23					
C09-R08001	22					
C09-R08001	21					
C09-R08001	20					
C09-R08001	19					
C09-R08001	18					
C09-R08001	17					
C09-R08001	16					
C09-R08001	15					
C09-R08001	14					
C09-R08001	13					
C09-R08001	12					
C09-R08001	11					
C09-R08001	10					
C09-R08001	9					
C09-R08001	8					
C09-R08001	7					
C09-R08001	6					
C09-R08001	5					
C09-R08001	4					
C09-R08001	3					
C09-R08001	2					
C09-R08001	1					
C10-R13001	42					
C10-R13001	41	192.168.126.10	N11008	Dell 6248	#FFCCFF	
C10-R13001	40					
C10-R13001	39	192.168.126.10	N11009	Dell 6248	#FFCCFF	
C10-R13001	38					
C10-R13001	37					
C10-R13001	36		S11001	Dell R5500	#C5D9F1	
C10-R13001	35		S11001	Dell R5500	#C5D9F1	
C10-R13001	34					
C10-R13001	33		S12181	Dell R5500	#C5D9F1	
C10-R13001	32		S12181	Dell R5500	#C5D9F1	
C10-R13001	31					
C10-R13001	30		S12182	Dell R5500	#C5D9F1	
C10-R13001	29		S12182	Dell R5500	#C5D9F1	
C10-R13001	28					
C10-R13001	27		S12183	Dell R5500	#C5D9F1	
C10-R13001	26		S12183	Dell R5500	#C5D9F1	
C10-R13001	25					
C10-R13001	24		S12184	Dell R5500	#C5D9F1	
C10-R13001	23		S12184	Dell R5500	#C5D9F1	
C10-R13001	22					
C10-R13001	21					
C10-R13001	20					
C10-R13001	19					
C10-R13001	18					
C10-R13001	17					
C10-R13001	16					
C10-R13001	15					
C10-R13001	14					
C10-R13001	13					
C10-R13001	12					
C10-R13001	11					
C10-R13001	10					
C10-R13001	9					
C10-R13001	8					
C10-R13001	7					
C10-R13001	6					
C10-R13001	5					
C10-R13001	4					
C10-R13001	3					
C10-R13001	2					
C10-R13001	1					"

box_info_array = excelslicer(box_info_seed)
box_info_array.each_with_index do |unit, index|
    if Box.where('number = ?', unit[0].split(' - ')[1]).exists?
        parent_box = Box.where('number = ?', unit[0].split(' - ')[1]).take

        box_info_unit = parent_box.box_infos.create (
            {
                :location => unit[0].split(' - ')[0],
                :index_start => unit[1],
                :index_length => '',
                :ip => unit[2],
                :name => unit[4],
                :color => unit[5]
            }
        )
        
        if box_info_unit.box.nil?
            byebug
        end
        if unit[3].present?
            if unit[3].split('')[0] == 'N'
                if Switch.where('number = ?', unit[3]).exists?
                    box_info_unit.switch = Switch.where('number = ?', unit[3]).take
                end
            elsif unit[3].split('')[0] == 'S'
                if Server.where('number = ?', unit[3]).exists?
                    box_info_unit.server = Server.where('number = ?', unit[3]).take
                end
            end
            box_info_unit.save
        end
    end
end